pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//                         File 'pic18_grammar.cpp'                          *
//                        Generated by version 2.4.3                         *
//                       may 1st, 2013, at 15h57'57"                         *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

//---------------------------------------------------------------------------*

#include "utilities/MF_MemoryControl.h"
#include "galgas2/C_galgas_CLI_Options.h"

#include "files/C_FileManager.h"

//---------------------------------------------------------------------------*

#include "pic18_grammar.h"

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

//---------------------------------------------------------------------------*
//                                                                           *
//                  N O N    T E R M I N A L    N A M E S                    *
//                                                                           *
//---------------------------------------------------------------------------*

static const char * gNonTerminalNames [154] = {
  "<body>",// Index 0
  "<data_definition>",// Index 1
  "<configuration_definition>",// Index 2
  "<declaration_in_ram>",// Index 3
  "<ram_definition>",// Index 4
  "<constant_definition>",// Index 5
  "<instruction_list>",// Index 6
  "<interrupt_definition>",// Index 7
  "<routine_definition>",// Index 8
  "<register_parsing>",// Index 9
  "<bit_number_parsing>",// Index 10
  "<optional_w_as_dest>",// Index 11
  "<condition_factor>",// Index 12
  "<condition_expression>",// Index 13
  "<condition_term>",// Index 14
  "<structured_instruction>",// Index 15
  "<structured_if_instruction>",// Index 16
  "<simple_instruction>",// Index 17
  "<immediate_expression>",// Index 18
  "<immediate_bitwise_term>",// Index 19
  "<immediate_bitwise_factor>",// Index 20
  "<immediate_term>",// Index 21
  "<immediate_factor>",// Index 22
  "<immediate_primary>",// Index 23
  "<start_symbol>",// Index 24
  "<midrange_instruction_list>",// Index 25
  "<midrange_interrupt_definition>",// Index 26
  "<midrange_routine_definition>",// Index 27
  "<midrange_structured_instruction>",// Index 28
  "<midrange_structured_if_instruction>",// Index 29
  "<midrange_simple_instruction>",// Index 30
  "<midrange_condition_factor>",// Index 31
  "<midrange_condition_expression>",// Index 32
  "<midrange_condition_term>",// Index 33
  "<baseline_instruction_list>",// Index 34
  "<baseline_routine_definition>",// Index 35
  "<baseline_structured_instruction>",// Index 36
  "<baseline_structured_if_instruction>",// Index 37
  "<baseline_simple_instruction>",// Index 38
  "<baseline_condition_factor>",// Index 39
  "<baseline_condition_expression>",// Index 40
  "<baseline_condition_term>",// Index 41
  "<routine_declaration>",// Index 42
  "<parse_bootloader>",// Index 43
  "<select_pic_31__38__5F_syntax_0>",// Index 44
  "<select_pic_31__38__5F_syntax_1>",// Index 45
  "<select_pic_31__38__5F_syntax_2>",// Index 46
  "<select_pic_31__38__5F_syntax_3>",// Index 47
  "<select_pic_31__38__5F_syntax_4>",// Index 48
  "<select_pic_31__38__5F_syntax_5>",// Index 49
  "<select_pic_31__38__5F_syntax_6>",// Index 50
  "<select_pic_31__38__5F_syntax_7>",// Index 51
  "<select_pic_31__38__5F_syntax_8>",// Index 52
  "<select_pic_31__38__5F_syntax_9>",// Index 53
  "<select_pic_31__38__5F_syntax_10>",// Index 54
  "<select_pic_31__38__5F_syntax_11>",// Index 55
  "<select_pic_31__38__5F_syntax_12>",// Index 56
  "<select_pic_31__38__5F_syntax_13>",// Index 57
  "<select_pic_31__38__5F_syntax_14>",// Index 58
  "<select_pic_31__38__5F_syntax_15>",// Index 59
  "<select_pic_31__38__5F_syntax_16>",// Index 60
  "<select_pic_31__38__5F_syntax_17>",// Index 61
  "<select_pic_31__38__5F_syntax_18>",// Index 62
  "<select_pic_31__38__5F_syntax_19>",// Index 63
  "<select_pic_31__38__5F_syntax_20>",// Index 64
  "<select_pic_31__38__5F_syntax_21>",// Index 65
  "<select_pic_31__38__5F_syntax_22>",// Index 66
  "<select_pic_31__38__5F_syntax_23>",// Index 67
  "<select_pic_31__38__5F_syntax_24>",// Index 68
  "<select_pic_31__38__5F_syntax_25>",// Index 69
  "<select_pic_31__38__5F_syntax_26>",// Index 70
  "<select_pic_31__38__5F_syntax_27>",// Index 71
  "<select_pic_31__38__5F_syntax_28>",// Index 72
  "<select_pic_31__38__5F_syntax_29>",// Index 73
  "<select_pic_31__38__5F_syntax_30>",// Index 74
  "<select_pic_31__38__5F_syntax_31>",// Index 75
  "<select_pic_31__38__5F_syntax_32>",// Index 76
  "<select_pic_31__38__5F_syntax_33>",// Index 77
  "<select_pic_31__38__5F_syntax_34>",// Index 78
  "<select_pic_31__38__5F_syntax_35>",// Index 79
  "<select_pic_31__38__5F_syntax_36>",// Index 80
  "<select_pic_31__38__5F_syntax_37>",// Index 81
  "<select_pic_31__38__5F_syntax_38>",// Index 82
  "<select_pic_31__38__5F_syntax_39>",// Index 83
  "<select_pic_31__38__5F_syntax_40>",// Index 84
  "<select_pic_31__38__5F_syntax_41>",// Index 85
  "<select_pic_31__38__5F_syntax_42>",// Index 86
  "<select_pic_31__38__5F_syntax_43>",// Index 87
  "<select_pic_31__38__5F_syntax_44>",// Index 88
  "<select_pic_31__38__5F_syntax_45>",// Index 89
  "<select_pic_31__38__5F_syntax_46>",// Index 90
  "<select_pic_31__38__5F_syntax_47>",// Index 91
  "<select_pic_31__38__5F_syntax_48>",// Index 92
  "<select_pic_31__38__5F_syntax_49>",// Index 93
  "<select_pic_31__38__5F_syntax_50>",// Index 94
  "<select_pic_31__38__5F_syntax_51>",// Index 95
  "<select_pic_31__38__5F_syntax_52>",// Index 96
  "<select_pic_31__38__5F_syntax_53>",// Index 97
  "<select_pic_31__38__5F_syntax_54>",// Index 98
  "<select_pic_31__38__5F_syntax_55>",// Index 99
  "<select_pic_31__38__5F_start_5F_symbol_0>",// Index 100
  "<select_midrange_5F_syntax_0>",// Index 101
  "<select_midrange_5F_syntax_1>",// Index 102
  "<select_midrange_5F_syntax_2>",// Index 103
  "<select_midrange_5F_syntax_3>",// Index 104
  "<select_midrange_5F_syntax_4>",// Index 105
  "<select_midrange_5F_syntax_5>",// Index 106
  "<select_midrange_5F_syntax_6>",// Index 107
  "<select_midrange_5F_syntax_7>",// Index 108
  "<select_midrange_5F_syntax_8>",// Index 109
  "<select_midrange_5F_syntax_9>",// Index 110
  "<select_midrange_5F_syntax_10>",// Index 111
  "<select_midrange_5F_syntax_11>",// Index 112
  "<select_midrange_5F_syntax_12>",// Index 113
  "<select_midrange_5F_syntax_13>",// Index 114
  "<select_midrange_5F_syntax_14>",// Index 115
  "<select_midrange_5F_syntax_15>",// Index 116
  "<select_midrange_5F_syntax_16>",// Index 117
  "<select_midrange_5F_syntax_17>",// Index 118
  "<select_midrange_5F_syntax_18>",// Index 119
  "<select_midrange_5F_syntax_19>",// Index 120
  "<select_midrange_5F_syntax_20>",// Index 121
  "<select_midrange_5F_syntax_21>",// Index 122
  "<select_midrange_5F_syntax_22>",// Index 123
  "<select_midrange_5F_syntax_23>",// Index 124
  "<select_baseline_5F_syntax_0>",// Index 125
  "<select_baseline_5F_syntax_1>",// Index 126
  "<select_baseline_5F_syntax_2>",// Index 127
  "<select_baseline_5F_syntax_3>",// Index 128
  "<select_baseline_5F_syntax_4>",// Index 129
  "<select_baseline_5F_syntax_5>",// Index 130
  "<select_baseline_5F_syntax_6>",// Index 131
  "<select_baseline_5F_syntax_7>",// Index 132
  "<select_baseline_5F_syntax_8>",// Index 133
  "<select_baseline_5F_syntax_9>",// Index 134
  "<select_baseline_5F_syntax_10>",// Index 135
  "<select_baseline_5F_syntax_11>",// Index 136
  "<select_baseline_5F_syntax_12>",// Index 137
  "<select_baseline_5F_syntax_13>",// Index 138
  "<select_baseline_5F_syntax_14>",// Index 139
  "<select_baseline_5F_syntax_15>",// Index 140
  "<select_baseline_5F_syntax_16>",// Index 141
  "<select_baseline_5F_syntax_17>",// Index 142
  "<select_baseline_5F_syntax_18>",// Index 143
  "<select_baseline_5F_syntax_19>",// Index 144
  "<select_baseline_5F_syntax_20>",// Index 145
  "<select_pic_31__38__5F_bootloader_5F_syntax_0>",// Index 146
  "<select_pic_31__38__5F_bootloader_5F_syntax_1>",// Index 147
  "<select_pic_31__38__5F_bootloader_5F_syntax_2>",// Index 148
  "<select_pic_31__38__5F_bootloader_5F_syntax_3>",// Index 149
  "<select_pic_31__38__5F_bootloader_5F_syntax_4>",// Index 150
  "<select_pic_31__38__5F_bootloader_5F_syntax_5>",// Index 151
  "<select_pic_31__38__5F_bootloader_5F_syntax_6>",// Index 152
  "<>"// Index 153
} ;

//---------------------------------------------------------------------------*
//                                                                           *
//           S L R    A N A L Y Z E R    A C T I O N    T A B L E            *
//                                                                           *
//---------------------------------------------------------------------------*

// Action tables handle shift and reduce actions ;
//  - a shift action is (terminal_symbol, SHIFT (n)) : if shifts to state n ;
//  - the accept action is (terminal_symbol, ACCEPT) ;
//  - a reduce action is (terminal_symbol, REDUCE (n)) ; if reduces to state n.

#define SHIFT(a) ((a) + 2)
#define REDUCE(a) (-(a) - 1)
#define ACCEPT (1)
#define END (-1)

