pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
static const PMSInt16 gActionTable [] = {
// State S0 (index = 0)
  C_Lexique_piccolo_5F_lexique::kToken_pic_31__38_, SHIFT (1)
, C_Lexique_piccolo_5F_lexique::kToken_midrange, SHIFT (2)
, C_Lexique_piccolo_5F_lexique::kToken_baseline, SHIFT (3)
, END
// State S1 (index = 7)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (6)
, C_Lexique_piccolo_5F_lexique::kToken_bootloader, SHIFT (7)
, END
// State S2 (index = 12)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (8)
, END
// State S3 (index = 15)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (9)
, END
// State S4 (index = 18)
, C_Lexique_piccolo_5F_lexique::kToken_, ACCEPT
, END
// State S5 (index = 21)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (52)
, END
// State S6 (index = 24)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, REDUCE (269)
, C_Lexique_piccolo_5F_lexique::kToken_implements, SHIFT (10)
, C_Lexique_piccolo_5F_lexique::kToken_uses, SHIFT (11)
, END
// State S7 (index = 31)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (13)
, END
// State S8 (index = 34)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, SHIFT (14)
, END
// State S9 (index = 37)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, SHIFT (15)
, END
// State S10 (index = 40)
, C_Lexique_piccolo_5F_lexique::kToken_bootloader, SHIFT (16)
, END
// State S11 (index = 43)
, C_Lexique_piccolo_5F_lexique::kToken_bootloader, SHIFT (17)
, END
// State S12 (index = 46)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, SHIFT (18)
, END
// State S13 (index = 49)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, SHIFT (19)
, END
// State S14 (index = 52)
, C_Lexique_piccolo_5F_lexique::kToken__3A_, SHIFT (20)
, END
// State S15 (index = 55)
, C_Lexique_piccolo_5F_lexique::kToken__3A_, SHIFT (21)
, END
// State S16 (index = 58)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, REDUCE (270)
, END
// State S17 (index = 61)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, REDUCE (271)
, END
// State S18 (index = 64)
, C_Lexique_piccolo_5F_lexique::kToken__3A_, SHIFT (22)
, END
// State S19 (index = 67)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, SHIFT (23)
, END
// State S20 (index = 70)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (24)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (28)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (29)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (282)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (272)
, END
// State S21 (index = 87)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (37)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (38)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (368)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (359)
, END
// State S22 (index = 102)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (45)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (46)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (47)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (48)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (49)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (88)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (54)
, END
// State S23 (index = 123)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, REDUCE (433)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (59)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (60)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (441)
, C_Lexique_piccolo_5F_lexique::kToken_rom, SHIFT (61)
, END
// State S24 (index = 134)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, SHIFT (65)
, END
// State S25 (index = 137)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, SHIFT (66)
, END
// State S26 (index = 140)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (67)
, END
// State S27 (index = 143)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (68)
, END
// State S28 (index = 146)
, C_Lexique_piccolo_5F_lexique::kToken_contextsave, SHIFT (69)
, END
// State S29 (index = 149)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (283)
, END
// State S30 (index = 152)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (24)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (28)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (29)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (282)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (272)
, END
// State S31 (index = 169)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (24)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (28)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (29)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (282)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (272)
, END
// State S32 (index = 186)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (24)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (28)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (29)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (282)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (272)
, END
// State S33 (index = 203)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (24)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (28)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (29)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (282)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (272)
, END
// State S34 (index = 220)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (24)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (28)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (29)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (282)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (272)
, END
// State S35 (index = 237)
, C_Lexique_piccolo_5F_lexique::kToken_end, SHIFT (75)
, END
// State S36 (index = 240)
, C_Lexique_piccolo_5F_lexique::kToken_routine, SHIFT (76)
, END
// State S37 (index = 243)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, SHIFT (77)
, END
// State S38 (index = 246)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (369)
, END
// State S39 (index = 249)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (37)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (38)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (368)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (359)
, END
// State S40 (index = 264)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (37)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (38)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (368)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (359)
, END
// State S41 (index = 279)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (37)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (38)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (368)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (359)
, END
// State S42 (index = 294)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (37)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (38)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (368)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (359)
, END
// State S43 (index = 309)
, C_Lexique_piccolo_5F_lexique::kToken_end, SHIFT (82)
, END
// State S44 (index = 312)
, C_Lexique_piccolo_5F_lexique::kToken_routine, SHIFT (83)
, END
// State S45 (index = 315)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, SHIFT (84)
, END
// State S46 (index = 318)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, SHIFT (85)
, END
// State S47 (index = 321)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (86)
, END
// State S48 (index = 324)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (87)
, END
// State S49 (index = 327)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (89)
, END
// State S50 (index = 330)
, C_Lexique_piccolo_5F_lexique::kToken_end, SHIFT (88)
, END
// State S51 (index = 333)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (45)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (46)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (47)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (48)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (49)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (88)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (54)
, END
// State S52 (index = 354)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (45)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (46)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (47)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (48)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (49)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (88)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (54)
, END
// State S53 (index = 375)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (45)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (46)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (47)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (48)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (49)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (88)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (54)
, END
// State S54 (index = 396)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (45)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (46)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (47)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (48)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (49)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (88)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (54)
, END
// State S55 (index = 417)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (45)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (46)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (47)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (48)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (49)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (88)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (54)
, END
// State S56 (index = 438)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (45)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (46)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (47)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (48)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (49)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (88)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (54)
, END
// State S57 (index = 459)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (0)
, END
// State S58 (index = 462)
, C_Lexique_piccolo_5F_lexique::kToken_routine, SHIFT (95)
, END
// State S59 (index = 465)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (96)
, END
// State S60 (index = 468)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (442)
, END
// State S61 (index = 471)
, C_Lexique_piccolo_5F_lexique::kToken__3D_, SHIFT (97)
, END
// State S62 (index = 474)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, REDUCE (433)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (59)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (60)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (441)
, C_Lexique_piccolo_5F_lexique::kToken_rom, SHIFT (61)
, END
// State S63 (index = 485)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, SHIFT (99)
, END
// State S64 (index = 488)
, C_Lexique_piccolo_5F_lexique::kToken_routine, SHIFT (100)
, END
// State S65 (index = 491)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (24)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (28)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (29)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (282)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (272)
, END
// State S66 (index = 508)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (102)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, REDUCE (65)
, END
// State S67 (index = 513)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, SHIFT (104)
, END
// State S68 (index = 516)
, C_Lexique_piccolo_5F_lexique::kToken__3D_, SHIFT (105)
, END
// State S69 (index = 519)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (106)
, END
// State S70 (index = 522)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (274)
, END
// State S71 (index = 525)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (275)
, END
// State S72 (index = 528)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (276)
, END
// State S73 (index = 531)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (277)
, END
// State S74 (index = 534)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (278)
, END
// State S75 (index = 537)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (28)
, END
// State S76 (index = 540)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (107)
, END
// State S77 (index = 543)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (37)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (38)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (368)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (359)
, END
// State S78 (index = 558)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (361)
, END
// State S79 (index = 561)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (362)
, END
// State S80 (index = 564)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (363)
, END
// State S81 (index = 567)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (364)
, END
// State S82 (index = 570)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (40)
, END
// State S83 (index = 573)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (109)
, END
// State S84 (index = 576)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (45)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (46)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (47)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (48)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (49)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (88)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (54)
, END
// State S85 (index = 597)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (45)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (46)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (47)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (25)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (26)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (27)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (48)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (49)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (88)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (54)
, END
// State S86 (index = 618)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, SHIFT (112)
, END
// State S87 (index = 621)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, REDUCE (86)
, C_Lexique_piccolo_5F_lexique::kToken_fast, SHIFT (113)
, END
// State S88 (index = 626)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (27)
, END
// State S89 (index = 629)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (61)
, END
// State S90 (index = 632)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (56)
, END
// State S91 (index = 635)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (57)
, END
// State S92 (index = 638)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (58)
, END
// State S93 (index = 641)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (59)
, END
// State S94 (index = 644)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (60)
, END
// State S95 (index = 647)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (115)
, END
// State S96 (index = 650)
, C_Lexique_piccolo_5F_lexique::kToken__3D_, SHIFT (116)
, END
// State S97 (index = 653)
, C_Lexique_piccolo_5F_lexique::kToken_integer, SHIFT (117)
, END
// State S98 (index = 656)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, REDUCE (434)
, END
// State S99 (index = 659)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, SHIFT (118)
, END
// State S100 (index = 662)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (119)
, END
// State S101 (index = 665)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (273)
, END
// State S102 (index = 668)
, C_Lexique_piccolo_5F_lexique::kToken__3A_, SHIFT (120)
, END
// State S103 (index = 671)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, SHIFT (121)
, END
// State S104 (index = 674)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, REDUCE (81)
, C_Lexique_piccolo_5F_lexique::kToken_byte, SHIFT (122)
, END
// State S105 (index = 679)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (125)
, C_Lexique_piccolo_5F_lexique::kToken_integer, SHIFT (126)
, C_Lexique_piccolo_5F_lexique::kToken__2D_, SHIFT (127)
, C_Lexique_piccolo_5F_lexique::kToken__28_, SHIFT (128)
, C_Lexique_piccolo_5F_lexique::kToken__7E_, SHIFT (129)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_char, SHIFT (130)
, C_Lexique_piccolo_5F_lexique::kToken__40_, SHIFT (131)
, END
// State S106 (index = 694)
, C_Lexique_piccolo_5F_lexique::kToken__2C_, SHIFT (139)
, END
// State S107 (index = 697)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, REDUCE (284)
, C_Lexique_piccolo_5F_lexique::kToken_bank, REDUCE (284)
, C_Lexique_piccolo_5F_lexique::kToken_page, SHIFT (140)
, END
// State S108 (index = 704)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (360)
, END
// State S109 (index = 707)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, REDUCE (370)
, C_Lexique_piccolo_5F_lexique::kToken_page, SHIFT (142)
, END
// State S110 (index = 712)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (55)
, END
// State S111 (index = 715)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (62)
, END
// State S112 (index = 718)
, C_Lexique_piccolo_5F_lexique::kToken_integer, SHIFT (144)
, END
// State S113 (index = 721)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, REDUCE (87)
, END
// State S114 (index = 724)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, SHIFT (145)
, END
// State S115 (index = 727)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, REDUCE (90)
, C_Lexique_piccolo_5F_lexique::kToken_bank, SHIFT (146)
, END
// State S116 (index = 732)
, C_Lexique_piccolo_5F_lexique::kToken_integer, SHIFT (148)
, END
// State S117 (index = 735)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, REDUCE (433)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (59)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (60)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (441)
, C_Lexique_piccolo_5F_lexique::kToken_rom, SHIFT (61)
, END
// State S118 (index = 746)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, REDUCE (437)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (60)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (441)
, END
// State S119 (index = 753)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, REDUCE (443)
, C_Lexique_piccolo_5F_lexique::kToken_ram, REDUCE (443)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, REDUCE (443)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (443)
, C_Lexique_piccolo_5F_lexique::kToken_bank, SHIFT (152)
, C_Lexique_piccolo_5F_lexique::kToken_rom, REDUCE (443)
, END
// State S120 (index = 766)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, SHIFT (154)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (155)
, END
// State S121 (index = 771)
, C_Lexique_piccolo_5F_lexique::kToken_mark, REDUCE (2)
, C_Lexique_piccolo_5F_lexique::kToken_include, REDUCE (2)
, C_Lexique_piccolo_5F_lexique::kToken_data, REDUCE (2)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, REDUCE (2)
, C_Lexique_piccolo_5F_lexique::kToken_ram, REDUCE (2)
, C_Lexique_piccolo_5F_lexique::kToken_const, REDUCE (2)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, REDUCE (2)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, REDUCE (2)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (2)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (2)
, END
// State S122 (index = 792)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (157)
, END
// State S123 (index = 795)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, REDUCE (81)
