pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
static const PMUInt32 gActionTableIndex [830] = {
  0  // S0
, 7  // S1
, 12  // S2
, 15  // S3
, 18  // S4
, 21  // S5
, 24  // S6
, 31  // S7
, 34  // S8
, 37  // S9
, 40  // S10
, 43  // S11
, 46  // S12
, 49  // S13
, 52  // S14
, 55  // S15
, 58  // S16
, 61  // S17
, 64  // S18
, 67  // S19
, 70  // S20
, 87  // S21
, 102  // S22
, 123  // S23
, 134  // S24
, 137  // S25
, 140  // S26
, 143  // S27
, 146  // S28
, 149  // S29
, 152  // S30
, 169  // S31
, 186  // S32
, 203  // S33
, 220  // S34
, 237  // S35
, 240  // S36
, 243  // S37
, 246  // S38
, 249  // S39
, 264  // S40
, 279  // S41
, 294  // S42
, 309  // S43
, 312  // S44
, 315  // S45
, 318  // S46
, 321  // S47
, 324  // S48
, 327  // S49
, 330  // S50
, 333  // S51
, 354  // S52
, 375  // S53
, 396  // S54
, 417  // S55
, 438  // S56
, 459  // S57
, 462  // S58
, 465  // S59
, 468  // S60
, 471  // S61
, 474  // S62
, 485  // S63
, 488  // S64
, 491  // S65
, 508  // S66
, 513  // S67
, 516  // S68
, 519  // S69
, 522  // S70
, 525  // S71
, 528  // S72
, 531  // S73
, 534  // S74
, 537  // S75
, 540  // S76
, 543  // S77
, 558  // S78
, 561  // S79
, 564  // S80
, 567  // S81
, 570  // S82
, 573  // S83
, 576  // S84
, 597  // S85
, 618  // S86
, 621  // S87
, 626  // S88
, 629  // S89
, 632  // S90
, 635  // S91
, 638  // S92
, 641  // S93
, 644  // S94
, 647  // S95
, 650  // S96
, 653  // S97
, 656  // S98
, 659  // S99
, 662  // S100
, 665  // S101
, 668  // S102
, 671  // S103
, 674  // S104
, 679  // S105
, 694  // S106
, 697  // S107
, 704  // S108
, 707  // S109
, 712  // S110
, 715  // S111
, 718  // S112
, 721  // S113
, 724  // S114
, 727  // S115
, 732  // S116
, 735  // S117
, 746  // S118
, 753  // S119
, 766  // S120
, 771  // S121
, 792  // S122
, 795  // S123
, 800  // S124
, 803  // S125
, 1016  // S126
, 1227  // S127
, 1242  // S128
, 1257  // S129
, 1272  // S130
, 1483  // S131
, 1486  // S132
, 1507  // S133
, 1690  // S134
, 1875  // S135
, 2072  // S136
, 2277  // S137
, 2488  // S138
, 2699  // S139
, 2702  // S140
, 2705  // S141
, 2710  // S142
, 2713  // S143
, 2716  // S144
, 2721  // S145
, 2866  // S146
, 2869  // S147
, 2872  // S148
, 2883  // S149
, 2886  // S150
, 2893  // S151
, 2896  // S152
, 2899  // S153
, 2910  // S154
, 2915  // S155
, 2920  // S156
, 2925  // S157
, 2934  // S158
, 2937  // S159
, 2960  // S160
, 2963  // S161
, 3174  // S162
, 3385  // S163
, 3388  // S164
, 3599  // S165
, 3602  // S166
, 3617  // S167
, 3632  // S168
, 3811  // S169
, 3826  // S170
, 4009  // S171
, 4024  // S172
, 4039  // S173
, 4054  // S174
, 4069  // S175
, 4084  // S176
, 4099  // S177
, 4284  // S178
, 4299  // S179
, 4314  // S180
, 4329  // S181
, 4344  // S182
, 4541  // S183
, 4556  // S184
, 4571  // S185
, 4586  // S186
, 4791  // S187
, 4794  // S188
, 4799  // S189
, 4802  // S190
, 4805  // S191
, 4808  // S192
, 4883  // S193
, 4886  // S194
, 4889  // S195
, 4892  // S196
, 4895  // S197
, 4898  // S198
, 4913  // S199
, 4916  // S200
, 5061  // S201
, 5064  // S202
, 5067  // S203
, 5070  // S204
, 5073  // S205
, 5076  // S206
, 5221  // S207
, 5232  // S208
, 5377  // S209
, 5380  // S210
, 5383  // S211
, 5386  // S212
, 5389  // S213
, 5392  // S214
, 5395  // S215
, 5398  // S216
, 5401  // S217
, 5404  // S218
, 5407  // S219
, 5410  // S220
, 5413  // S221
, 5416  // S222
, 5419  // S223
, 5422  // S224
, 5425  // S225
, 5428  // S226
, 5431  // S227
, 5434  // S228
, 5437  // S229
, 5440  // S230
, 5443  // S231
, 5446  // S232
, 5449  // S233
, 5452  // S234
, 5455  // S235
, 5458  // S236
, 5461  // S237
, 5464  // S238
, 5467  // S239
, 5470  // S240
, 5473  // S241
, 5476  // S242
, 5479  // S243
, 5482  // S244
, 5485  // S245
, 5630  // S246
, 5775  // S247
, 5920  // S248
, 6065  // S249
, 6210  // S250
, 6355  // S251
, 6500  // S252
, 6515  // S253
, 6530  // S254
, 6545  // S255
, 6560  // S256
, 6575  // S257
, 6590  // S258
, 6605  // S259
, 6608  // S260
, 6617  // S261
, 6626  // S262
, 6629  // S263
, 6774  // S264
, 6919  // S265
, 6930  // S266
, 7075  // S267
, 7220  // S268
, 7223  // S269
, 7226  // S270
, 7229  // S271
, 7232  // S272
, 7247  // S273
, 7254  // S274
, 7399  // S275
, 7402  // S276
, 7405  // S277
, 7408  // S278
, 7415  // S279
, 7418  // S280
, 7421  // S281
, 7428  // S282
, 7431  // S283
, 7642  // S284
, 7645  // S285
, 7828  // S286
, 8011  // S287
, 8196  // S288
, 8381  // S289
, 8566  // S290
, 8751  // S291
, 8936  // S292
, 9121  // S293
, 9306  // S294
, 9511  // S295
, 9716  // S296
, 9921  // S297
, 10126  // S298
, 10337  // S299
, 10548  // S300
, 10759  // S301
, 10844  // S302
, 10851  // S303
, 10936  // S304
, 10939  // S305
, 10942  // S306
, 10945  // S307
, 11020  // S308
, 11031  // S309
, 11106  // S310
, 11109  // S311
, 11112  // S312
, 11115  // S313
, 11118  // S314
, 11121  // S315
, 11124  // S316
, 11127  // S317
, 11130  // S318
, 11133  // S319
, 11136  // S320
, 11139  // S321
, 11142  // S322
, 11145  // S323
, 11148  // S324
, 11223  // S325
, 11298  // S326
, 11373  // S327
, 11388  // S328
, 11403  // S329
, 11418  // S330
, 11433  // S331
, 11436  // S332
, 11439  // S333
, 11514  // S334
, 11589  // S335
, 11592  // S336
, 11595  // S337
, 11670  // S338
, 11745  // S339
, 11756  // S340
, 11831  // S341
, 11906  // S342
, 11909  // S343
, 11912  // S344
, 11915  // S345
, 11930  // S346
, 11935  // S347
, 11956  // S348
, 11959  // S349
, 12104  // S350
, 12249  // S351
, 12424  // S352
, 12569  // S353
, 12584  // S354
, 12729  // S355
, 12874  // S356
, 13019  // S357
, 13022  // S358
, 13025  // S359
, 13028  // S360
, 13031  // S361
, 13042  // S362
, 13053  // S363
, 13198  // S364
, 13201  // S365
, 13204  // S366
, 13207  // S367
, 13210  // S368
, 13355  // S369
, 13358  // S370
, 13503  // S371
, 13648  // S372
, 13795  // S373
, 13798  // S374
, 13943  // S375
, 14088  // S376
, 14233  // S377
, 14378  // S378
, 14523  // S379
, 14668  // S380
, 14813  // S381
, 14958  // S382
, 15103  // S383
, 15248  // S384
, 15269  // S385
, 15280  // S386
, 15291  // S387
, 15448  // S388
, 15593  // S389
, 15596  // S390
, 15741  // S391
, 15886  // S392
, 15889  // S393
, 15892  // S394
, 15895  // S395
, 15898  // S396
, 15901  // S397
, 15906  // S398
, 15917  // S399
, 15920  // S400
, 15923  // S401
, 15934  // S402
, 15937  // S403
, 15942  // S404
, 15947  // S405
, 16158  // S406
, 16161  // S407
, 16340  // S408
, 16519  // S409
, 16702  // S410
, 16899  // S411
, 17096  // S412
, 17293  // S413
, 17490  // S414
, 17695  // S415
, 17900  // S416
, 18105  // S417
, 18108  // S418
, 18111  // S419
, 18114  // S420
, 18199  // S421
, 18202  // S422
, 18205  // S423
, 18290  // S424
, 18301  // S425
, 18386  // S426
, 18389  // S427
, 18392  // S428
, 18395  // S429
, 18398  // S430
, 18401  // S431
, 18404  // S432
, 18407  // S433
, 18410  // S434
, 18413  // S435
, 18416  // S436
, 18419  // S437
, 18422  // S438
, 18425  // S439
, 18428  // S440
, 18431  // S441
, 18434  // S442
, 18519  // S443
, 18604  // S444
, 18689  // S445
, 18704  // S446
, 18719  // S447
, 18734  // S448
, 18749  // S449
, 18764  // S450
, 18779  // S451
, 18782  // S452
, 18785  // S453
, 18870  // S454
, 18873  // S455
, 18958  // S456
, 19043  // S457
, 19054  // S458
, 19139  // S459
, 19224  // S460
, 19227  // S461
, 19230  // S462
, 19233  // S463
, 19248  // S464
, 19251  // S465
, 19254  // S466
, 19257  // S467
, 19260  // S468
, 19263  // S469
, 19338  // S470
, 19341  // S471
, 19344  // S472
, 19347  // S473
, 19350  // S474
, 19361  // S475
, 19364  // S476
, 19367  // S477
, 19442  // S478
, 19445  // S479
, 19448  // S480
, 19451  // S481
, 19526  // S482
, 19601  // S483
, 19676  // S484
, 19691  // S485
, 19702  // S486
, 19713  // S487
, 19870  // S488
, 19945  // S489
, 19948  // S490
, 20023  // S491
, 20026  // S492
, 20029  // S493
, 20032  // S494
, 20205  // S495
, 20208  // S496
, 20211  // S497
, 20356  // S498
, 20359  // S499
, 20540  // S500
, 20551  // S501
, 20554  // S502
, 20557  // S503
, 20574  // S504
, 20581  // S505
, 20588  // S506
, 20593  // S507
, 20600  // S508
, 20603  // S509
, 20606  // S510
, 20609  // S511
, 20612  // S512
, 20615  // S513
, 20620  // S514
, 20623  // S515
, 20630  // S516
, 20775  // S517
, 20890  // S518
, 20895  // S519
, 20898  // S520
, 20901  // S521
, 21046  // S522
, 21061  // S523
, 21064  // S524
, 21209  // S525
, 21364  // S526
, 21369  // S527
, 21374  // S528
, 21377  // S529
, 21398  // S530
, 21403  // S531
, 21406  // S532
, 21419  // S533
, 21430  // S534
, 21437  // S535
, 21446  // S536
, 21451  // S537
, 21456  // S538
, 21471  // S539
, 21556  // S540
, 21641  // S541
, 21726  // S542
, 21729  // S543
, 21732  // S544
, 21735  // S545
, 21738  // S546
, 21749  // S547
, 21752  // S548
, 21755  // S549
, 21840  // S550
, 21843  // S551
, 21846  // S552
, 21849  // S553
, 21934  // S554
, 22019  // S555
, 22104  // S556
, 22189  // S557
, 22206  // S558
, 22217  // S559
, 22228  // S560
, 22385  // S561
, 22470  // S562
, 22473  // S563
, 22558  // S564
, 22563  // S565
, 22566  // S566
, 22583  // S567
, 22658  // S568
, 22661  // S569
, 22672  // S570
, 22675  // S571
, 22678  // S572
, 22681  // S573
, 22688  // S574
, 22695  // S575
, 22700  // S576
, 22707  // S577
, 22710  // S578
, 22715  // S579
, 22790  // S580
, 22797  // S581
, 22854  // S582
, 22859  // S583
, 22862  // S584
, 22937  // S585
, 22942  // S586
, 22945  // S587
, 22948  // S588
, 23093  // S589
, 23102  // S590
, 23107  // S591
, 23114  // S592
, 23121  // S593
, 23124  // S594
, 23127  // S595
, 23130  // S596
, 23133  // S597
, 23136  // S598
, 23139  // S599
, 23144  // S600
, 23151  // S601
, 23162  // S602
, 23167  // S603
, 23178  // S604
, 23181  // S605
, 23186  // S606
, 23189  // S607
, 23192  // S608
, 23195  // S609
, 23362  // S610
, 23527  // S611
, 23532  // S612
, 23647  // S613
, 23650  // S614
, 23795  // S615
, 23798  // S616
, 23943  // S617
, 23946  // S618
, 23949  // S619
, 24094  // S620
, 24239  // S621
, 24384  // S622
, 24539  // S623
, 24684  // S624
, 24687  // S625
, 24690  // S626
, 24693  // S627
, 24696  // S628
, 24699  // S629
, 24710  // S630
, 24713  // S631
, 24720  // S632
, 24725  // S633
, 24728  // S634
, 24733  // S635
, 24736  // S636
, 24821  // S637
, 24824  // S638
, 24835  // S639
, 24838  // S640
, 24841  // S641
, 24844  // S642
, 24851  // S643
, 24858  // S644
, 24863  // S645
, 24870  // S646
, 24873  // S647
, 24878  // S648
, 24963  // S649
, 24970  // S650
, 25027  // S651
, 25032  // S652
, 25035  // S653
, 25120  // S654
, 25125  // S655
, 25128  // S656
, 25131  // S657
, 25136  // S658
, 25143  // S659
, 25148  // S660
, 25159  // S661
, 25164  // S662
, 25175  // S663
, 25178  // S664
, 25183  // S665
, 25186  // S666
, 25189  // S667
, 25264  // S668
, 25267  // S669
, 25342  // S670
, 25345  // S671
, 25348  // S672
, 25423  // S673
, 25498  // S674
, 25643  // S675
, 25816  // S676
, 25831  // S677
, 25834  // S678
, 25837  // S679
, 25840  // S680
, 25985  // S681
, 25988  // S682
, 25995  // S683
, 26002  // S684
, 26009  // S685
, 26016  // S686
, 26023  // S687
, 26030  // S688
, 26039  // S689
, 26046  // S690
, 26051  // S691
, 26200  // S692
, 26203  // S693
, 26206  // S694
, 26209  // S695
, 26374  // S696
, 26377  // S697
, 26380  // S698
, 26525  // S699
, 26528  // S700
, 26531  // S701
, 26534  // S702
, 26537  // S703
, 26542  // S704
, 26545  // S705
, 26556  // S706
, 26559  // S707
, 26562  // S708
, 26567  // S709
, 26572  // S710
, 26577  // S711
, 26580  // S712
, 26583  // S713
, 26668  // S714
, 26673  // S715
, 26680  // S716
, 26685  // S717
, 26696  // S718
, 26701  // S719
, 26712  // S720
, 26715  // S721
, 26720  // S722
, 26723  // S723
, 26726  // S724
, 26811  // S725
, 26814  // S726
, 26899  // S727
, 26902  // S728
, 26905  // S729
, 26990  // S730
, 27075  // S731
, 27078  // S732
, 27081  // S733
, 27090  // S734
, 27097  // S735
, 27102  // S736
, 27181  // S737
, 27184  // S738
, 27187  // S739
, 27190  // S740
, 27193  // S741
, 27196  // S742
, 27199  // S743
, 27204  // S744
, 27351  // S745
, 27498  // S746
, 27645  // S747
, 27792  // S748
, 27799  // S749
, 27806  // S750
, 27811  // S751
, 27814  // S752
, 27817  // S753
, 27824  // S754
, 27827  // S755
, 27942  // S756
, 27945  // S757
, 27948  // S758
, 27955  // S759
, 27964  // S760
, 27967  // S761
, 27970  // S762
, 28181  // S763
, 28184  // S764
, 28193  // S765
, 28200  // S766
, 28205  // S767
, 28294  // S768
, 28297  // S769
, 28300  // S770
, 28303  // S771
, 28306  // S772
, 28309  // S773
, 28312  // S774
, 28317  // S775
, 28324  // S776
, 28331  // S777
, 28336  // S778
, 28339  // S779
, 28342  // S780
, 28349  // S781
, 28406  // S782
, 28409  // S783
, 28412  // S784
, 28427  // S785
, 28572  // S786
, 28575  // S787
, 28720  // S788
, 28723  // S789
, 28868  // S790
, 28871  // S791
, 29016  // S792
, 29181  // S793
, 29326  // S794
, 29471  // S795
, 29616  // S796
, 29623  // S797
, 29638  // S798
, 29645  // S799
, 29652  // S800
, 29657  // S801
, 29660  // S802
, 29663  // S803
, 29670  // S804
, 29727  // S805
, 29730  // S806
, 29733  // S807
, 29808  // S808
, 29883  // S809
, 29958  // S810
, 30105  // S811
, 30252  // S812
, 30399  // S813
, 30546  // S814
, 30551  // S815
, 30556  // S816
, 30561  // S817
, 30646  // S818
, 30731  // S819
, 30816  // S820
, 30821  // S821
, 30966  // S822
, 31111  // S823
, 31256  // S824
, 31401  // S825
, 31404  // S826
, 31407  // S827
, 31412  // S828
, 31415  // S829
} ;

//---------------------------------------------------------------------------*
//                                                                           *
//                       SLR states successors table                         *
//                                                                           *
//---------------------------------------------------------------------------*

// Successor tables handle non terminal successors ;
// an entry is (non_terminal_symbol, n) ; successor is state n.

static const PMSInt16 gSuccessorTable0 [5] = {24, 4,
  43, 5, -1} ;

static const PMSInt16 gSuccessorTable6 [3] = {100, 12, -1} ;

