pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
static const PMSInt16 gSuccessorTable20 [15] = {2, 30,
  4, 31,
  5, 32,
  26, 33,
  27, 34,
  101, 35,
  103, 36, -1} ;

static const PMSInt16 gSuccessorTable21 [13] = {2, 39,
  4, 40,
  5, 41,
  35, 42,
  125, 43,
  127, 44, -1} ;

static const PMSInt16 gSuccessorTable22 [19] = {0, 50,
  1, 51,
  2, 52,
  4, 53,
  5, 54,
  7, 55,
  8, 56,
  44, 57,
  57, 58, -1} ;

static const PMSInt16 gSuccessorTable23 [7] = {42, 62,
  146, 63,
  149, 64, -1} ;

static const PMSInt16 gSuccessorTable30 [15] = {2, 30,
  4, 31,
  5, 32,
  26, 33,
  27, 34,
  101, 70,
  103, 36, -1} ;

static const PMSInt16 gSuccessorTable31 [15] = {2, 30,
  4, 31,
  5, 32,
  26, 33,
  27, 34,
  101, 71,
  103, 36, -1} ;

static const PMSInt16 gSuccessorTable32 [15] = {2, 30,
  4, 31,
  5, 32,
  26, 33,
  27, 34,
  101, 72,
  103, 36, -1} ;

static const PMSInt16 gSuccessorTable33 [15] = {2, 30,
  4, 31,
  5, 32,
  26, 33,
  27, 34,
  101, 73,
  103, 36, -1} ;

static const PMSInt16 gSuccessorTable34 [15] = {2, 30,
  4, 31,
  5, 32,
  26, 33,
  27, 34,
  101, 74,
  103, 36, -1} ;

static const PMSInt16 gSuccessorTable39 [13] = {2, 39,
  4, 40,
  5, 41,
  35, 42,
  125, 78,
  127, 44, -1} ;

static const PMSInt16 gSuccessorTable40 [13] = {2, 39,
  4, 40,
  5, 41,
  35, 42,
  125, 79,
  127, 44, -1} ;

static const PMSInt16 gSuccessorTable41 [13] = {2, 39,
  4, 40,
  5, 41,
  35, 42,
  125, 80,
  127, 44, -1} ;

static const PMSInt16 gSuccessorTable42 [13] = {2, 39,
  4, 40,
  5, 41,
  35, 42,
  125, 81,
  127, 44, -1} ;

static const PMSInt16 gSuccessorTable51 [17] = {1, 51,
  2, 52,
  4, 53,
  5, 54,
  7, 55,
  8, 56,
  44, 89,
  57, 58, -1} ;

static const PMSInt16 gSuccessorTable52 [17] = {1, 51,
  2, 52,
  4, 53,
  5, 54,
  7, 55,
  8, 56,
  44, 90,
  57, 58, -1} ;

static const PMSInt16 gSuccessorTable53 [17] = {1, 51,
  2, 52,
  4, 53,
  5, 54,
  7, 55,
  8, 56,
  44, 91,
  57, 58, -1} ;

static const PMSInt16 gSuccessorTable54 [17] = {1, 51,
  2, 52,
  4, 53,
  5, 54,
  7, 55,
  8, 56,
  44, 92,
  57, 58, -1} ;

static const PMSInt16 gSuccessorTable55 [17] = {1, 51,
  2, 52,
  4, 53,
  5, 54,
  7, 55,
  8, 56,
  44, 93,
  57, 58, -1} ;

static const PMSInt16 gSuccessorTable56 [17] = {1, 51,
  2, 52,
  4, 53,
  5, 54,
  7, 55,
  8, 56,
  44, 94,
  57, 58, -1} ;

static const PMSInt16 gSuccessorTable62 [7] = {42, 62,
  146, 98,
  149, 64, -1} ;

static const PMSInt16 gSuccessorTable65 [15] = {2, 30,
  4, 31,
  5, 32,
  26, 33,
  27, 34,
  101, 101,
  103, 36, -1} ;

static const PMSInt16 gSuccessorTable66 [3] = {46, 103, -1} ;

static const PMSInt16 gSuccessorTable77 [13] = {2, 39,
  4, 40,
  5, 41,
  35, 42,
  125, 108,
  127, 44, -1} ;

static const PMSInt16 gSuccessorTable84 [17] = {1, 51,
  2, 52,
  4, 53,
  5, 54,
  7, 55,
  8, 56,
  44, 110,
  57, 58, -1} ;

static const PMSInt16 gSuccessorTable85 [17] = {1, 51,
  2, 52,
  4, 53,
  5, 54,
  7, 55,
  8, 56,
  44, 111,
  57, 58, -1} ;

static const PMSInt16 gSuccessorTable87 [3] = {56, 114, -1} ;

static const PMSInt16 gSuccessorTable104 [5] = {3, 123,
  54, 124, -1} ;

static const PMSInt16 gSuccessorTable105 [15] = {18, 132,
  19, 133,
  20, 134,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable107 [3] = {104, 141, -1} ;

static const PMSInt16 gSuccessorTable109 [3] = {128, 143, -1} ;

static const PMSInt16 gSuccessorTable115 [3] = {58, 147, -1} ;

static const PMSInt16 gSuccessorTable117 [7] = {42, 62,
  146, 149,
  149, 64, -1} ;

static const PMSInt16 gSuccessorTable118 [7] = {42, 150,
  147, 151,
  149, 64, -1} ;

static const PMSInt16 gSuccessorTable119 [3] = {150, 153, -1} ;

static const PMSInt16 gSuccessorTable120 [3] = {47, 156, -1} ;

static const PMSInt16 gSuccessorTable123 [5] = {3, 123,
  54, 158, -1} ;

static const PMSInt16 gSuccessorTable125 [3] = {98, 161, -1} ;

static const PMSInt16 gSuccessorTable127 [5] = {23, 162,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable128 [15] = {18, 163,
  19, 133,
  20, 134,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable129 [5] = {23, 164,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable133 [3] = {92, 168, -1} ;

static const PMSInt16 gSuccessorTable134 [3] = {93, 170, -1} ;

static const PMSInt16 gSuccessorTable135 [3] = {94, 177, -1} ;

static const PMSInt16 gSuccessorTable136 [3] = {95, 182, -1} ;

static const PMSInt16 gSuccessorTable137 [3] = {96, 186, -1} ;

static const PMSInt16 gSuccessorTable141 [3] = {105, 190, -1} ;

static const PMSInt16 gSuccessorTable144 [3] = {45, 194, -1} ;

static const PMSInt16 gSuccessorTable145 [23] = {6, 262,
  15, 263,
  17, 264,
  55, 265,
  71, 266,
  84, 267,
  85, 268,
  86, 269,
  87, 270,
  88, 271,
  89, 272, -1} ;

static const PMSInt16 gSuccessorTable148 [7] = {42, 62,
  146, 275,
  149, 64, -1} ;

static const PMSInt16 gSuccessorTable150 [7] = {42, 150,
  147, 276,
  149, 64, -1} ;

static const PMSInt16 gSuccessorTable156 [3] = {46, 279, -1} ;

static const PMSInt16 gSuccessorTable157 [3] = {48, 281, -1} ;

static const PMSInt16 gSuccessorTable166 [13] = {19, 285,
  20, 134,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable167 [13] = {19, 286,
  20, 134,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable169 [11] = {20, 287,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable171 [9] = {21, 288,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable172 [9] = {21, 289,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable173 [9] = {21, 290,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable174 [9] = {21, 291,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable175 [9] = {21, 292,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable176 [9] = {21, 293,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable178 [7] = {22, 294,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable179 [7] = {22, 295,
  23, 137,
  97, 138, -1} ;

