pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
static const PMSInt16 gSuccessorTable180 [7] = {22, 296,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable181 [7] = {22, 297,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable183 [5] = {23, 298,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable184 [5] = {23, 299,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable185 [5] = {23, 300,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable192 [21] = {34, 336,
  36, 337,
  38, 338,
  126, 339,
  129, 340,
  135, 341,
  136, 342,
  137, 343,
  138, 344,
  139, 345, -1} ;

static const PMSInt16 gSuccessorTable198 [15] = {18, 349,
  19, 133,
  20, 134,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable201 [3] = {9, 352, -1} ;

static const PMSInt16 gSuccessorTable206 [23] = {6, 357,
  15, 263,
  17, 264,
  55, 265,
  71, 266,
  84, 267,
  85, 268,
  86, 269,
  87, 270,
  88, 271,
  89, 272, -1} ;

static const PMSInt16 gSuccessorTable207 [11] = {9, 362,
  13, 363,
  16, 364,
  78, 365,
  80, 366, -1} ;

static const PMSInt16 gSuccessorTable208 [23] = {6, 367,
  15, 263,
  17, 264,
  55, 265,
  71, 266,
  84, 267,
  85, 268,
  86, 269,
  87, 270,
  88, 271,
  89, 272, -1} ;

static const PMSInt16 gSuccessorTable230 [3] = {9, 369, -1} ;

static const PMSInt16 gSuccessorTable260 [3] = {90, 378, -1} ;

static const PMSInt16 gSuccessorTable261 [3] = {91, 383, -1} ;

static const PMSInt16 gSuccessorTable263 [21] = {15, 263,
  17, 264,
  55, 385,
  71, 266,
  84, 267,
  85, 268,
  86, 269,
  87, 270,
  88, 271,
  89, 272, -1} ;

static const PMSInt16 gSuccessorTable264 [21] = {15, 263,
  17, 264,
  55, 386,
  71, 266,
  84, 267,
  85, 268,
  86, 269,
  87, 270,
  88, 271,
  89, 272, -1} ;

static const PMSInt16 gSuccessorTable268 [3] = {9, 387, -1} ;

static const PMSInt16 gSuccessorTable269 [3] = {9, 388, -1} ;

static const PMSInt16 gSuccessorTable270 [3] = {9, 389, -1} ;

static const PMSInt16 gSuccessorTable272 [15] = {18, 391,
  19, 133,
  20, 134,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable273 [3] = {59, 395, -1} ;

static const PMSInt16 gSuccessorTable274 [23] = {6, 396,
  15, 263,
  17, 264,
  55, 265,
  71, 266,
  84, 267,
  85, 268,
  86, 269,
  87, 270,
  88, 271,
  89, 272, -1} ;

static const PMSInt16 gSuccessorTable278 [3] = {151, 401, -1} ;

static const PMSInt16 gSuccessorTable281 [3] = {49, 404, -1} ;

static const PMSInt16 gSuccessorTable285 [3] = {92, 407, -1} ;

static const PMSInt16 gSuccessorTable286 [3] = {92, 408, -1} ;

static const PMSInt16 gSuccessorTable287 [3] = {93, 409, -1} ;

static const PMSInt16 gSuccessorTable294 [3] = {95, 410, -1} ;

static const PMSInt16 gSuccessorTable295 [3] = {95, 411, -1} ;

static const PMSInt16 gSuccessorTable296 [3] = {95, 412, -1} ;

static const PMSInt16 gSuccessorTable297 [3] = {95, 413, -1} ;

static const PMSInt16 gSuccessorTable298 [3] = {96, 414, -1} ;

static const PMSInt16 gSuccessorTable299 [3] = {96, 415, -1} ;

static const PMSInt16 gSuccessorTable300 [3] = {96, 416, -1} ;

static const PMSInt16 gSuccessorTable301 [21] = {25, 454,
  28, 455,
  30, 456,
  102, 457,
  108, 458,
  114, 459,
  115, 460,
  116, 461,
  117, 462,
  118, 463, -1} ;

static const PMSInt16 gSuccessorTable302 [3] = {106, 467, -1} ;

static const PMSInt16 gSuccessorTable303 [21] = {25, 468,
  28, 455,
  30, 456,
  102, 457,
  108, 458,
  114, 459,
  115, 460,
  116, 461,
  117, 462,
  118, 463, -1} ;

static const PMSInt16 gSuccessorTable307 [21] = {34, 470,
  36, 337,
  38, 338,
  126, 339,
  129, 340,
  135, 341,
  136, 342,
  137, 343,
  138, 344,
  139, 345, -1} ;

static const PMSInt16 gSuccessorTable308 [11] = {9, 475,
  37, 476,
  40, 477,
  130, 478,
  131, 479, -1} ;

static const PMSInt16 gSuccessorTable309 [21] = {34, 480,
  36, 337,
  38, 338,
  126, 339,
  129, 340,
  135, 341,
  136, 342,
  137, 343,
  138, 344,
  139, 345, -1} ;

static const PMSInt16 gSuccessorTable337 [19] = {36, 337,
  38, 338,
  126, 485,
  129, 340,
  135, 341,
  136, 342,
  137, 343,
  138, 344,
  139, 345, -1} ;

static const PMSInt16 gSuccessorTable338 [19] = {36, 337,
  38, 338,
  126, 486,
  129, 340,
  135, 341,
  136, 342,
  137, 343,
  138, 344,
  139, 345, -1} ;

static const PMSInt16 gSuccessorTable342 [3] = {9, 487, -1} ;

static const PMSInt16 gSuccessorTable343 [3] = {9, 488, -1} ;

static const PMSInt16 gSuccessorTable344 [3] = {9, 489, -1} ;

static const PMSInt16 gSuccessorTable345 [15] = {18, 490,
  19, 133,
  20, 134,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable346 [3] = {45, 491, -1} ;

static const PMSInt16 gSuccessorTable351 [3] = {61, 494, -1} ;

static const PMSInt16 gSuccessorTable352 [23] = {6, 495,
  15, 263,
  17, 264,
  55, 265,
  71, 266,
  84, 267,
  85, 268,
  86, 269,
  87, 270,
  88, 271,
  89, 272, -1} ;

static const PMSInt16 gSuccessorTable353 [15] = {18, 496,
  19, 133,
  20, 134,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable358 [3] = {9, 498, -1} ;

static const PMSInt16 gSuccessorTable361 [13] = {9, 503,
  12, 504,
  13, 505,
  14, 506,
  64, 507,
  65, 508, -1} ;

static const PMSInt16 gSuccessorTable362 [3] = {77, 514, -1} ;

static const PMSInt16 gSuccessorTable363 [23] = {6, 515,
  15, 263,
  17, 264,
  55, 265,
  71, 266,
  84, 267,
  85, 268,
  86, 269,
  87, 270,
  88, 271,
  89, 272, -1} ;

static const PMSInt16 gSuccessorTable366 [3] = {9, 518, -1} ;

static const PMSInt16 gSuccessorTable387 [5] = {11, 524,
  63, 525, -1} ;

static const PMSInt16 gSuccessorTable397 [5] = {4, 530,
  148, 531, -1} ;

static const PMSInt16 gSuccessorTable403 [3] = {51, 537, -1} ;

static const PMSInt16 gSuccessorTable421 [3] = {9, 540, -1} ;

static const PMSInt16 gSuccessorTable423 [21] = {25, 542,
  28, 455,
  30, 456,
  102, 457,
  108, 458,
  114, 459,
  115, 460,
  116, 461,
  117, 462,
  118, 463, -1} ;

static const PMSInt16 gSuccessorTable424 [11] = {9, 547,
  29, 548,
  32, 549,
  109, 550,
  110, 551, -1} ;

static const PMSInt16 gSuccessorTable425 [21] = {25, 552,
  28, 455,
  30, 456,
  102, 457,
  108, 458,
  114, 459,
  115, 460,
  116, 461,
  117, 462,
  118, 463, -1} ;

static const PMSInt16 gSuccessorTable455 [19] = {28, 455,
  30, 456,
  102, 558,
  108, 458,
  114, 459,
  115, 460,
  116, 461,
  117, 462,
  118, 463, -1} ;

static const PMSInt16 gSuccessorTable456 [19] = {28, 455,
  30, 456,
  102, 559,
  108, 458,
  114, 459,
  115, 460,
  116, 461,
  117, 462,
  118, 463, -1} ;

