pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
static const PMSInt16 gSuccessorTable460 [3] = {9, 560, -1} ;

static const PMSInt16 gSuccessorTable461 [3] = {9, 561, -1} ;

static const PMSInt16 gSuccessorTable462 [3] = {9, 562, -1} ;

static const PMSInt16 gSuccessorTable463 [15] = {18, 563,
  19, 133,
  20, 134,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable471 [3] = {9, 568, -1} ;

static const PMSInt16 gSuccessorTable474 [13] = {9, 572,
  39, 573,
  40, 574,
  41, 575,
  140, 576,
  141, 577, -1} ;

static const PMSInt16 gSuccessorTable477 [21] = {34, 580,
  36, 337,
  38, 338,
  126, 339,
  129, 340,
  135, 341,
  136, 342,
  137, 343,
  138, 344,
  139, 345, -1} ;

static const PMSInt16 gSuccessorTable479 [3] = {9, 582, -1} ;

static const PMSInt16 gSuccessorTable487 [5] = {11, 584,
  63, 525, -1} ;

static const PMSInt16 gSuccessorTable499 [3] = {61, 494, -1} ;

static const PMSInt16 gSuccessorTable500 [11] = {9, 503,
  12, 591,
  13, 505,
  64, 507,
  65, 508, -1} ;

static const PMSInt16 gSuccessorTable503 [3] = {67, 600, -1} ;

static const PMSInt16 gSuccessorTable504 [3] = {70, 602, -1} ;

static const PMSInt16 gSuccessorTable506 [3] = {69, 604, -1} ;

static const PMSInt16 gSuccessorTable508 [3] = {9, 605, -1} ;

static const PMSInt16 gSuccessorTable513 [3] = {10, 611, -1} ;

static const PMSInt16 gSuccessorTable515 [3] = {83, 615, -1} ;

static const PMSInt16 gSuccessorTable517 [15] = {17, 616,
  84, 267,
  85, 268,
  86, 269,
  87, 270,
  88, 271,
  89, 272, -1} ;

static const PMSInt16 gSuccessorTable518 [3] = {81, 618, -1} ;

static const PMSInt16 gSuccessorTable519 [3] = {13, 619, -1} ;

static const PMSInt16 gSuccessorTable520 [3] = {9, 620, -1} ;

static const PMSInt16 gSuccessorTable522 [15] = {18, 621,
  19, 133,
  20, 134,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable526 [3] = {10, 623, -1} ;

static const PMSInt16 gSuccessorTable527 [3] = {60, 625, -1} ;

static const PMSInt16 gSuccessorTable530 [5] = {4, 530,
  148, 626, -1} ;

static const PMSInt16 gSuccessorTable532 [3] = {152, 629, -1} ;

static const PMSInt16 gSuccessorTable535 [3] = {53, 631, -1} ;

static const PMSInt16 gSuccessorTable537 [3] = {50, 633, -1} ;

static const PMSInt16 gSuccessorTable538 [15] = {18, 634,
  19, 133,
  20, 134,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable540 [21] = {25, 635,
  28, 455,
  30, 456,
  102, 457,
  108, 458,
  114, 459,
  115, 460,
  116, 461,
  117, 462,
  118, 463, -1} ;

static const PMSInt16 gSuccessorTable543 [3] = {9, 637, -1} ;

static const PMSInt16 gSuccessorTable546 [13] = {9, 641,
  31, 642,
  32, 643,
  33, 644,
  119, 645,
  120, 646, -1} ;

static const PMSInt16 gSuccessorTable549 [21] = {25, 649,
  28, 455,
  30, 456,
  102, 457,
  108, 458,
  114, 459,
  115, 460,
  116, 461,
  117, 462,
  118, 463, -1} ;

static const PMSInt16 gSuccessorTable551 [3] = {9, 651, -1} ;

static const PMSInt16 gSuccessorTable560 [5] = {11, 653,
  63, 525, -1} ;

static const PMSInt16 gSuccessorTable564 [3] = {107, 656, -1} ;

static const PMSInt16 gSuccessorTable569 [11] = {9, 572,
  39, 658,
  40, 574,
  140, 576,
  141, 577, -1} ;

static const PMSInt16 gSuccessorTable573 [3] = {145, 661, -1} ;

static const PMSInt16 gSuccessorTable575 [3] = {144, 663, -1} ;

static const PMSInt16 gSuccessorTable577 [3] = {9, 664, -1} ;

static const PMSInt16 gSuccessorTable578 [3] = {10, 665, -1} ;

static const PMSInt16 gSuccessorTable580 [3] = {134, 668, -1} ;

static const PMSInt16 gSuccessorTable581 [13] = {38, 669,
  135, 341,
  136, 342,
  137, 343,
  138, 344,
  139, 345, -1} ;

static const PMSInt16 gSuccessorTable582 [3] = {132, 671, -1} ;

static const PMSInt16 gSuccessorTable583 [3] = {40, 672, -1} ;

static const PMSInt16 gSuccessorTable585 [3] = {10, 673, -1} ;

static const PMSInt16 gSuccessorTable589 [3] = {72, 680, -1} ;

static const PMSInt16 gSuccessorTable590 [3] = {10, 681, -1} ;

static const PMSInt16 gSuccessorTable599 [3] = {10, 688, -1} ;

static const PMSInt16 gSuccessorTable601 [11] = {9, 503,
  12, 689,
  13, 505,
  64, 507,
  65, 508, -1} ;

static const PMSInt16 gSuccessorTable603 [13] = {9, 503,
  12, 504,
  13, 505,
  14, 690,
  64, 507,
  65, 508, -1} ;

static const PMSInt16 gSuccessorTable605 [3] = {66, 693, -1} ;

static const PMSInt16 gSuccessorTable609 [3] = {62, 695, -1} ;

static const PMSInt16 gSuccessorTable611 [3] = {79, 697, -1} ;

static const PMSInt16 gSuccessorTable612 [15] = {17, 698,
  84, 267,
  85, 268,
  86, 269,
  87, 270,
  88, 271,
  89, 272, -1} ;

static const PMSInt16 gSuccessorTable613 [5] = {13, 363,
  16, 699, -1} ;

static const PMSInt16 gSuccessorTable614 [23] = {6, 700,
  15, 263,
  17, 264,
  55, 265,
  71, 266,
  84, 267,
  85, 268,
  86, 269,
  87, 270,
  88, 271,
  89, 272, -1} ;

static const PMSInt16 gSuccessorTable619 [23] = {6, 703,
  15, 263,
  17, 264,
  55, 265,
  71, 266,
  84, 267,
  85, 268,
  86, 269,
  87, 270,
  88, 271,
  89, 272, -1} ;

static const PMSInt16 gSuccessorTable631 [3] = {52, 708, -1} ;

static const PMSInt16 gSuccessorTable632 [3] = {51, 709, -1} ;

static const PMSInt16 gSuccessorTable634 [3] = {99, 712, -1} ;

static const PMSInt16 gSuccessorTable638 [11] = {9, 641,
  31, 715,
  32, 643,
  119, 645,
  120, 646, -1} ;

static const PMSInt16 gSuccessorTable642 [3] = {124, 718, -1} ;

static const PMSInt16 gSuccessorTable644 [3] = {123, 720, -1} ;

static const PMSInt16 gSuccessorTable646 [3] = {9, 721, -1} ;

static const PMSInt16 gSuccessorTable647 [3] = {10, 722, -1} ;

static const PMSInt16 gSuccessorTable649 [3] = {113, 725, -1} ;

static const PMSInt16 gSuccessorTable650 [13] = {30, 726,
  114, 459,
  115, 460,
  116, 461,
  117, 462,
  118, 463, -1} ;

static const PMSInt16 gSuccessorTable651 [3] = {111, 728, -1} ;

static const PMSInt16 gSuccessorTable652 [3] = {32, 729, -1} ;

static const PMSInt16 gSuccessorTable654 [3] = {10, 730, -1} ;

static const PMSInt16 gSuccessorTable657 [3] = {10, 732, -1} ;

static const PMSInt16 gSuccessorTable659 [3] = {10, 733, -1} ;

static const PMSInt16 gSuccessorTable660 [11] = {9, 572,
  39, 734,
  40, 574,
  140, 576,
  141, 577, -1} ;

static const PMSInt16 gSuccessorTable662 [13] = {9, 572,
  39, 573,
  40, 574,
  41, 735,
  140, 576,
  141, 577, -1} ;

static const PMSInt16 gSuccessorTable664 [3] = {142, 738, -1} ;

static const PMSInt16 gSuccessorTable666 [5] = {37, 739,
  40, 477, -1} ;

static const PMSInt16 gSuccessorTable667 [21] = {34, 740,
  36, 337,
  38, 338,
  126, 339,
  129, 340,
  135, 341,
  136, 342,
  137, 343,
  138, 344,
  139, 345, -1} ;

static const PMSInt16 gSuccessorTable672 [21] = {34, 743,
  36, 337,
  38, 338,
  126, 339,
  129, 340,
  135, 341,
  136, 342,
  137, 343,
  138, 344,
  139, 345, -1} ;

