pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
static const PMSInt16 gSuccessorTable676 [15] = {18, 744,
  19, 133,
  20, 134,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable688 [3] = {68, 749, -1} ;

static const PMSInt16 gSuccessorTable689 [3] = {70, 750, -1} ;

static const PMSInt16 gSuccessorTable690 [3] = {69, 751, -1} ;

static const PMSInt16 gSuccessorTable703 [3] = {82, 757, -1} ;

static const PMSInt16 gSuccessorTable709 [3] = {50, 760, -1} ;

static const PMSInt16 gSuccessorTable714 [3] = {10, 763, -1} ;

static const PMSInt16 gSuccessorTable716 [3] = {10, 764, -1} ;

static const PMSInt16 gSuccessorTable717 [11] = {9, 641,
  31, 765,
  32, 643,
  119, 645,
  120, 646, -1} ;

static const PMSInt16 gSuccessorTable719 [13] = {9, 641,
  31, 642,
  32, 643,
  33, 766,
  119, 645,
  120, 646, -1} ;

static const PMSInt16 gSuccessorTable721 [3] = {121, 769, -1} ;

static const PMSInt16 gSuccessorTable723 [5] = {29, 770,
  32, 549, -1} ;

static const PMSInt16 gSuccessorTable724 [21] = {25, 771,
  28, 455,
  30, 456,
  102, 457,
  108, 458,
  114, 459,
  115, 460,
  116, 461,
  117, 462,
  118, 463, -1} ;

static const PMSInt16 gSuccessorTable729 [21] = {25, 774,
  28, 455,
  30, 456,
  102, 457,
  108, 458,
  114, 459,
  115, 460,
  116, 461,
  117, 462,
  118, 463, -1} ;

static const PMSInt16 gSuccessorTable733 [3] = {143, 776, -1} ;

static const PMSInt16 gSuccessorTable734 [3] = {145, 777, -1} ;

static const PMSInt16 gSuccessorTable735 [3] = {144, 778, -1} ;

static const PMSInt16 gSuccessorTable743 [3] = {133, 783, -1} ;

static const PMSInt16 gSuccessorTable744 [3] = {73, 785, -1} ;

static const PMSInt16 gSuccessorTable745 [3] = {74, 787, -1} ;

static const PMSInt16 gSuccessorTable746 [3] = {75, 789, -1} ;

static const PMSInt16 gSuccessorTable747 [3] = {76, 791, -1} ;

static const PMSInt16 gSuccessorTable755 [15] = {17, 793,
  84, 267,
  85, 268,
  86, 269,
  87, 270,
  88, 271,
  89, 272, -1} ;

static const PMSInt16 gSuccessorTable756 [3] = {13, 794, -1} ;

static const PMSInt16 gSuccessorTable759 [3] = {53, 796, -1} ;

static const PMSInt16 gSuccessorTable764 [3] = {122, 799, -1} ;

static const PMSInt16 gSuccessorTable765 [3] = {124, 800, -1} ;

static const PMSInt16 gSuccessorTable766 [3] = {123, 801, -1} ;

static const PMSInt16 gSuccessorTable774 [3] = {112, 806, -1} ;

static const PMSInt16 gSuccessorTable781 [13] = {38, 807,
  135, 341,
  136, 342,
  137, 343,
  138, 344,
  139, 345, -1} ;

static const PMSInt16 gSuccessorTable782 [3] = {40, 808, -1} ;

static const PMSInt16 gSuccessorTable784 [15] = {18, 810,
  19, 133,
  20, 134,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable794 [23] = {6, 814,
  15, 263,
  17, 264,
  55, 265,
  71, 266,
  84, 267,
  85, 268,
  86, 269,
  87, 270,
  88, 271,
  89, 272, -1} ;

static const PMSInt16 gSuccessorTable796 [3] = {52, 815, -1} ;

static const PMSInt16 gSuccessorTable797 [15] = {18, 816,
  19, 133,
  20, 134,
  21, 135,
  22, 136,
  23, 137,
  97, 138, -1} ;

static const PMSInt16 gSuccessorTable804 [13] = {30, 817,
  114, 459,
  115, 460,
  116, 461,
  117, 462,
  118, 463, -1} ;

static const PMSInt16 gSuccessorTable805 [3] = {32, 818, -1} ;

static const PMSInt16 gSuccessorTable808 [21] = {34, 820,
  36, 337,
  38, 338,
  126, 339,
  129, 340,
  135, 341,
  136, 342,
  137, 343,
  138, 344,
  139, 345, -1} ;

static const PMSInt16 gSuccessorTable810 [3] = {73, 821, -1} ;

static const PMSInt16 gSuccessorTable811 [3] = {74, 822, -1} ;

static const PMSInt16 gSuccessorTable812 [3] = {75, 823, -1} ;

static const PMSInt16 gSuccessorTable813 [3] = {76, 824, -1} ;

static const PMSInt16 gSuccessorTable814 [3] = {82, 825, -1} ;

static const PMSInt16 gSuccessorTable816 [3] = {99, 826, -1} ;

static const PMSInt16 gSuccessorTable818 [21] = {25, 827,
  28, 455,
  30, 456,
  102, 457,
  108, 458,
  114, 459,
  115, 460,
  116, 461,
  117, 462,
  118, 463, -1} ;

static const PMSInt16 gSuccessorTable820 [3] = {133, 828, -1} ;

static const PMSInt16 gSuccessorTable827 [3] = {112, 829, -1} ;

static const PMSInt16 * gSuccessorTable [830] = {
gSuccessorTable0, NULL, NULL, NULL, 
  NULL, NULL, gSuccessorTable6, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable20, gSuccessorTable21, gSuccessorTable22, gSuccessorTable23, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, gSuccessorTable30, gSuccessorTable31, 
  gSuccessorTable32, gSuccessorTable33, gSuccessorTable34, NULL, 
  NULL, NULL, NULL, gSuccessorTable39, 
  gSuccessorTable40, gSuccessorTable41, gSuccessorTable42, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable51, 
  gSuccessorTable52, gSuccessorTable53, gSuccessorTable54, gSuccessorTable55, 
  gSuccessorTable56, NULL, NULL, NULL, 
  NULL, NULL, gSuccessorTable62, NULL, 
  NULL, gSuccessorTable65, gSuccessorTable66, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, gSuccessorTable77, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable84, gSuccessorTable85, NULL, gSuccessorTable87, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable104, gSuccessorTable105, NULL, gSuccessorTable107, 
  NULL, gSuccessorTable109, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable115, 
  NULL, gSuccessorTable117, gSuccessorTable118, gSuccessorTable119, 
  gSuccessorTable120, NULL, NULL, gSuccessorTable123, 
  NULL, gSuccessorTable125, NULL, gSuccessorTable127, 
  gSuccessorTable128, gSuccessorTable129, NULL, NULL, 
  NULL, gSuccessorTable133, gSuccessorTable134, gSuccessorTable135, 
  gSuccessorTable136, gSuccessorTable137, NULL, NULL, 
  NULL, gSuccessorTable141, NULL, NULL, 
  gSuccessorTable144, gSuccessorTable145, NULL, NULL, 
  gSuccessorTable148, NULL, gSuccessorTable150, NULL, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable156, gSuccessorTable157, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, gSuccessorTable166, gSuccessorTable167, 
  NULL, gSuccessorTable169, NULL, gSuccessorTable171, 
  gSuccessorTable172, gSuccessorTable173, gSuccessorTable174, gSuccessorTable175, 
  gSuccessorTable176, NULL, gSuccessorTable178, gSuccessorTable179, 
  gSuccessorTable180, gSuccessorTable181, NULL, gSuccessorTable183, 
  gSuccessorTable184, gSuccessorTable185, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable192, NULL, NULL, NULL, 
  NULL, NULL, gSuccessorTable198, NULL, 
  NULL, gSuccessorTable201, NULL, NULL, 
  NULL, NULL, gSuccessorTable206, gSuccessorTable207, 
  gSuccessorTable208, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, gSuccessorTable230, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable260, gSuccessorTable261, NULL, gSuccessorTable263, 
  gSuccessorTable264, NULL, NULL, NULL, 
  gSuccessorTable268, gSuccessorTable269, gSuccessorTable270, NULL, 
  gSuccessorTable272, gSuccessorTable273, gSuccessorTable274, NULL, 
  NULL, NULL, gSuccessorTable278, NULL, 
  NULL, gSuccessorTable281, NULL, NULL, 
  NULL, gSuccessorTable285, gSuccessorTable286, gSuccessorTable287, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, gSuccessorTable294, gSuccessorTable295, 
  gSuccessorTable296, gSuccessorTable297, gSuccessorTable298, gSuccessorTable299, 
  gSuccessorTable300, gSuccessorTable301, gSuccessorTable302, gSuccessorTable303, 
  NULL, NULL, NULL, gSuccessorTable307, 
  gSuccessorTable308, gSuccessorTable309, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, gSuccessorTable337, gSuccessorTable338, NULL, 
  NULL, NULL, gSuccessorTable342, gSuccessorTable343, 
  gSuccessorTable344, gSuccessorTable345, gSuccessorTable346, NULL, 
  NULL, NULL, NULL, gSuccessorTable351, 
  gSuccessorTable352, gSuccessorTable353, NULL, NULL, 
  NULL, NULL, gSuccessorTable358, NULL, 
  NULL, gSuccessorTable361, gSuccessorTable362, gSuccessorTable363, 
  NULL, NULL, gSuccessorTable366, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable387, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, gSuccessorTable397, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable403, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, gSuccessorTable421, NULL, gSuccessorTable423, 
  gSuccessorTable424, gSuccessorTable425, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable455, 
  gSuccessorTable456, NULL, NULL, NULL, 
  gSuccessorTable460, gSuccessorTable461, gSuccessorTable462, gSuccessorTable463, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable471, 
  NULL, NULL, gSuccessorTable474, NULL, 
  NULL, gSuccessorTable477, NULL, gSuccessorTable479, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable487, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable499, 
  gSuccessorTable500, NULL, NULL, gSuccessorTable503, 
  gSuccessorTable504, NULL, gSuccessorTable506, NULL, 
  gSuccessorTable508, NULL, NULL, NULL, 
  NULL, gSuccessorTable513, NULL, gSuccessorTable515, 
  NULL, gSuccessorTable517, gSuccessorTable518, gSuccessorTable519, 
  gSuccessorTable520, NULL, gSuccessorTable522, NULL, 
  NULL, NULL, gSuccessorTable526, gSuccessorTable527, 
  NULL, NULL, gSuccessorTable530, NULL, 
  gSuccessorTable532, NULL, NULL, gSuccessorTable535, 
  NULL, gSuccessorTable537, gSuccessorTable538, NULL, 
  gSuccessorTable540, NULL, NULL, gSuccessorTable543, 
  NULL, NULL, gSuccessorTable546, NULL, 
  NULL, gSuccessorTable549, NULL, gSuccessorTable551, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable560, NULL, NULL, NULL, 
  gSuccessorTable564, NULL, NULL, NULL, 
  NULL, gSuccessorTable569, NULL, NULL, 
  NULL, gSuccessorTable573, NULL, gSuccessorTable575, 
  NULL, gSuccessorTable577, gSuccessorTable578, NULL, 
  gSuccessorTable580, gSuccessorTable581, gSuccessorTable582, gSuccessorTable583, 
  NULL, gSuccessorTable585, NULL, NULL, 
  NULL, gSuccessorTable589, gSuccessorTable590, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable599, 
  NULL, gSuccessorTable601, NULL, gSuccessorTable603, 
  NULL, gSuccessorTable605, NULL, NULL, 
  NULL, gSuccessorTable609, NULL, gSuccessorTable611, 
  gSuccessorTable612, gSuccessorTable613, gSuccessorTable614, NULL, 
  NULL, NULL, NULL, gSuccessorTable619, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable631, 
  gSuccessorTable632, NULL, gSuccessorTable634, NULL, 
  NULL, NULL, gSuccessorTable638, NULL, 
  NULL, NULL, gSuccessorTable642, NULL, 
  gSuccessorTable644, NULL, gSuccessorTable646, gSuccessorTable647, 
  NULL, gSuccessorTable649, gSuccessorTable650, gSuccessorTable651, 
  gSuccessorTable652, NULL, gSuccessorTable654, NULL, 
  NULL, gSuccessorTable657, NULL, gSuccessorTable659, 
  gSuccessorTable660, NULL, gSuccessorTable662, NULL, 
  gSuccessorTable664, NULL, gSuccessorTable666, gSuccessorTable667, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable672, NULL, NULL, NULL, 
  gSuccessorTable676, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable688, gSuccessorTable689, gSuccessorTable690, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable703, 
  NULL, NULL, NULL, NULL, 
  NULL, gSuccessorTable709, NULL, NULL, 
  NULL, NULL, gSuccessorTable714, NULL, 
  gSuccessorTable716, gSuccessorTable717, NULL, gSuccessorTable719, 
  NULL, gSuccessorTable721, NULL, gSuccessorTable723, 
  gSuccessorTable724, NULL, NULL, NULL, 
  NULL, gSuccessorTable729, NULL, NULL, 
  NULL, gSuccessorTable733, gSuccessorTable734, gSuccessorTable735, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable743, 
  gSuccessorTable744, gSuccessorTable745, gSuccessorTable746, gSuccessorTable747, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable755, 
  gSuccessorTable756, NULL, NULL, gSuccessorTable759, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable764, gSuccessorTable765, gSuccessorTable766, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, gSuccessorTable774, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, gSuccessorTable781, gSuccessorTable782, NULL, 
  gSuccessorTable784, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, gSuccessorTable794, NULL, 
  gSuccessorTable796, gSuccessorTable797, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable804, gSuccessorTable805, NULL, NULL, 
  gSuccessorTable808, NULL, gSuccessorTable810, gSuccessorTable811, 
  gSuccessorTable812, gSuccessorTable813, gSuccessorTable814, NULL, 
  gSuccessorTable816, NULL, gSuccessorTable818, NULL, 
  gSuccessorTable820, NULL, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable827, 
  NULL, NULL} ;

//---------------------------------------------------------------------------*
//                                                                           *
//     Production rules infos (left non terminal, size of right string)      *
//                                                                           *
//---------------------------------------------------------------------------*

static const PMSInt16 gProductionsTable [451 * 2] = {
  0, 1,
  1, 6,
  2, 4,
  3, 4,
  4, 5,
  5, 4,
  6, 1,
  7, 6,
  8, 7,
  9, 2,
  10, 2,
  10, 1,
  11, 1,
  12, 2,
  12, 1,
  12, 1,
  13, 4,
  14, 2,
  15, 1,
  16, 3,
  17, 1,
  18, 2,
  19, 2,
  20, 2,
  21, 2,
  22, 2,
  23, 1,
  24, 7,
  24, 6,
  25, 1,
  26, 8,
  27, 8,
  28, 1,
  29, 3,
  30, 1,
  31, 2,
  31, 1,
  31, 1,
  32, 4,
  33, 2,
  24, 6,
  34, 1,
  35, 7,
  36, 1,
  37, 3,
  38, 1,
  39, 2,
  39, 1,
  39, 1,
  40, 4,
  41, 2,
  43, 13,
  24, 1,
  42, 4,
  44, 0,
  44, 3,
  44, 2,
  44, 2,
  44, 2,
  44, 2,
  44, 2,
  44, 2,
  44, 3,
  45, 0,
  45, 3,
  46, 0,
  46, 4,
  47, 1,
  47, 1,
  48, 0,
  48, 3,
  49, 0,
  49, 4,
  50, 0,
  50, 3,
  51, 3,
  51, 1,
  52, 0,
  52, 4,
  53, 0,
  53, 3,
  54, 0,
  54, 2,
  55, 0,
  55, 2,
  55, 2,
  56, 0,
  56, 1,
  57, 0,
  57, 1,
  58, 0,
  58, 3,
  59, 1,
  59, 3,
  59, 2,
  60, 0,
  60, 2,
  61, 0,
  61, 3,
  62, 0,
  62, 3,
  63, 0,
  63, 2,
  64, 4,
  64, 2,
  64, 4,
  64, 2,
  64, 1,
  65, 1,
  65, 1,
  66, 0,
  66, 2,
  67, 2,
  67, 2,
  67, 2,
  67, 2,
  67, 2,
  67, 2,
  68, 0,
  68, 1,
  69, 0,
  69, 3,
  70, 0,
  70, 3,
  71, 5,
  71, 2,
  71, 2,
  71, 1,
  71, 4,
  71, 5,
  71, 3,
  71, 5,
  71, 4,
  71, 7,
  71, 3,
  71, 7,
  71, 2,
  72, 3,
  72, 3,
  72, 3,
  72, 3,
  73, 0,
  73, 3,
  74, 0,
  74, 3,
  75, 0,
  75, 3,
  76, 0,
  76, 3,
  77, 2,
  77, 2,
  77, 2,
  77, 1,
  78, 4,
  78, 4,
  79, 0,
  79, 1,
  80, 1,
  80, 1,
  81, 0,
  81, 2,
  82, 0,
  82, 4,
  83, 0,
  83, 2,
  83, 2,
  84, 3,
  84, 2,
  84, 4,
  84, 4,
  84, 2,
  84, 2,
  84, 2,
  84, 2,
  84, 2,
  84, 2,
  84, 2,
  84, 3,
  84, 1,
  84, 1,
  84, 1,
  84, 1,
  84, 1,
  84, 1,
  84, 1,
  84, 2,
  84, 4,
  84, 2,
  84, 2,
  85, 1,
  85, 1,
  85, 1,
  85, 1,
  85, 1,
  85, 1,
  85, 1,
  85, 1,
  85, 1,
  85, 1,
  85, 1,
  85, 1,
  85, 1,
  85, 1,
  85, 1,
  85, 1,
  85, 1,
  86, 1,
  86, 1,
  86, 1,
  86, 1,
  86, 1,
  87, 1,
  87, 1,
  87, 1,
  88, 1,
  88, 1,
  88, 1,
  88, 1,
  88, 1,
  88, 1,
  88, 1,
  88, 1,
  89, 1,
  89, 1,
  89, 1,
  89, 1,
  89, 1,
  89, 1,
  89, 1,
  90, 1,
  90, 1,
  90, 1,
  90, 1,
  91, 1,
  91, 1,
  91, 1,
  91, 1,
  92, 0,
  92, 3,
  92, 3,
  93, 0,
  93, 3,
  94, 0,
  94, 2,
  94, 2,
  94, 2,
  94, 2,
  94, 2,
  94, 2,
  95, 0,
  95, 3,
  95, 3,
  95, 3,
  95, 3,
  96, 0,
  96, 3,
  96, 3,
  96, 3,
  97, 2,
  97, 2,
  97, 1,
  97, 1,
  97, 2,
  97, 3,
  97, 8,
  98, 0,
  98, 3,
  99, 0,
  99, 5,
  100, 0,
  100, 2,
  100, 2,
  101, 0,
  101, 3,
  101, 2,
  101, 2,
  101, 2,
  101, 2,
  101, 2,
  102, 0,
  102, 2,
  102, 2,
  103, 0,
  103, 1,
  104, 0,
  104, 2,
  105, 0,
  105, 3,
  106, 1,
  106, 3,
  106, 2,
  107, 0,
  107, 2,
  108, 2,
  108, 4,
  108, 1,
  108, 3,
  108, 4,
  108, 7,
  108, 3,
  108, 7,
  108, 2,
  108, 2,
  108, 2,
  109, 4,
  109, 3,
  110, 1,
  110, 1,
  111, 0,
  111, 2,
  112, 0,
  112, 4,
  113, 0,
  113, 2,
  113, 2,
  114, 3,
  114, 2,
  114, 4,
  114, 2,
  114, 2,
  114, 1,
  114, 1,
  114, 1,
  114, 1,
  114, 2,
  115, 1,
  115, 1,
  115, 1,
  115, 1,
  115, 1,
  115, 1,
  115, 1,
  115, 1,
  115, 1,
  115, 1,
  115, 1,
  115, 1,
  116, 1,
  116, 1,
  117, 1,
  117, 1,
  118, 1,
  118, 1,
  118, 1,
  118, 1,
  118, 1,
  118, 1,
  119, 4,
  119, 4,
  120, 1,
  120, 1,
  121, 0,
  121, 2,
  122, 0,
  122, 1,
  123, 0,
  123, 3,
  124, 0,
  124, 3,
  125, 0,
  125, 3,
  125, 2,
  125, 2,
  125, 2,
  125, 2,
  126, 0,
  126, 2,
  126, 2,
  127, 0,
  127, 1,
  128, 0,
  128, 2,
  129, 3,
  129, 4,
  129, 7,
  129, 3,
  129, 7,
  129, 2,
  130, 4,
  130, 3,
  131, 1,
  131, 1,
  132, 0,
  132, 2,
  133, 0,
  133, 4,
  134, 0,
  134, 2,
  134, 2,
  135, 3,
  135, 2,
  135, 4,
  135, 2,
  135, 2,
  135, 1,
  135, 1,
  135, 1,
  135, 1,
  135, 1,
  135, 2,
  135, 2,
  136, 1,
  136, 1,
  136, 1,
  136, 1,
  136, 1,
  136, 1,
  136, 1,
  136, 1,
  136, 1,
  136, 1,
  136, 1,
  136, 1,
  137, 1,
  137, 1,
  138, 1,
  138, 1,
  139, 1,
  139, 1,
  139, 1,
  139, 1,
  140, 4,
  140, 4,
  141, 1,
  141, 1,
  142, 0,
  142, 2,
  143, 0,
  143, 1,
  144, 0,
  144, 3,
  145, 0,
  145, 3,
  146, 0,
  146, 2,
  146, 4,
  146, 5,
  147, 0,
  147, 2,
  148, 0,
  148, 2,
  149, 0,
  149, 1,
  150, 0,
  150, 3,
  151, 1,
  151, 3,
  151, 2,
  152, 0,
  152, 2,
  153, 1
} ;

//---------------------------------------------------------------------------*
//                                                                           *
//                    'body' non terminal implementation                     *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_grammar::nt_body_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 0 :
      rule_pic_31__38__5F_syntax_body_i0_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

