pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
void cGrammar_pic_31__38__5F_grammar::_performSourceStringParsing_ (C_Compiler * inCompiler,
                                GALGAS_string inSourceString
                                COMMA_UNUSED_LOCATION_ARGS) {
  C_Lexique_piccolo_5F_lexique * scanner = NULL ;
  macroMyNew (scanner, C_Lexique_piccolo_5F_lexique (inCompiler, inSourceString.stringValue (), "" COMMA_HERE)) ;
  if (scanner->sourceText () != NULL) {
    const bool ok = scanner->performBottomUpParsing (gActionTable, gNonTerminalNames,
                                                     gActionTableIndex, gSuccessorTable,
                                                     gProductionsTable) ;
    if (ok && ! executionModeIsSyntaxAnalysisOnly ()) {
      cGrammar_pic_31__38__5F_grammar _grammar ;
      _grammar.nt_start_5F_symbol_ (scanner) ;
    }
  }
  macroDetachSharedObject (scanner) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                   Grammar start symbol implementation                     *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_grammar::_performSourceFileParsing_importBootloaderSpecification (C_Compiler * inCompiler,
                                GALGAS_lstring inFilePath,
                                GALGAS_piccoloDeviceModel &  parameter_1,
                                GALGAS_uint &  parameter_2,
                                GALGAS_ramBankTable &  parameter_3,
                                GALGAS_registerTable &  parameter_4,
                                GALGAS_bootloaderReservedRAMmap &  parameter_5,
                                GALGAS_routineDeclarationList &  parameter_6,
                                GALGAS_routineDeclarationList &  parameter_7,
                                GALGAS_luint &  parameter_8
                                COMMA_LOCATION_ARGS) {
  if (inFilePath.isValid ()) {
    const GALGAS_string filePathAsString = inFilePath.reader_string (HERE) ;
    C_String filePath = filePathAsString.stringValue () ;
    if (! C_FileManager::isAbsolutePath (filePath)) {
      filePath = inCompiler->sourceFilePath ().stringByDeletingLastPathComponent ().stringByAppendingPathComponent (filePath) ;
    }
    if (C_FileManager::fileExistsAtPath (filePath)) {
      C_Lexique_piccolo_5F_lexique * scanner = NULL ;
      macroMyNew (scanner, C_Lexique_piccolo_5F_lexique (inCompiler, "", "", filePath COMMA_HERE)) ;
      if (scanner->sourceText () != NULL) {
        const bool ok = scanner->performBottomUpParsing (gActionTable, gNonTerminalNames,
                                                         gActionTableIndex, gSuccessorTable,
                                                         gProductionsTable) ;
        if (ok && ! executionModeIsSyntaxAnalysisOnly ()) {
          cGrammar_pic_31__38__5F_grammar grammar ;
          grammar.nt_start_5F_symbol_importBootloaderSpecification (parameter_1, parameter_2, parameter_3, parameter_4, parameter_5, parameter_6, parameter_7, parameter_8, scanner) ;
        }
      }else{
        C_String message ;
        message << "the '" << filePath << "' file exists, but cannot be read" ;
        const GALGAS_location errorLocation (inFilePath.reader_location (THERE)) ;
        inCompiler->semanticErrorAtLocation (errorLocation, message COMMA_THERE) ;
        parameter_1.drop () ;
        parameter_2.drop () ;
        parameter_3.drop () ;
        parameter_4.drop () ;
        parameter_5.drop () ;
        parameter_6.drop () ;
        parameter_7.drop () ;
        parameter_8.drop () ;
    }
    macroDetachSharedObject (scanner) ;
  }else{
    C_String message ;
    message << "the '" << filePath << "' file does not exist" ;
    const GALGAS_location errorLocation (inFilePath.reader_location (THERE)) ;
    inCompiler->semanticErrorAtLocation (errorLocation, message COMMA_THERE) ;
    parameter_1.drop () ;
    parameter_2.drop () ;
    parameter_3.drop () ;
    parameter_4.drop () ;
    parameter_5.drop () ;
    parameter_6.drop () ;
    parameter_7.drop () ;
    parameter_8.drop () ;
    }
  }
}

//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_grammar::_performSourceStringParsing_importBootloaderSpecification (C_Compiler * inCompiler,
                                GALGAS_string inSourceString,
                                GALGAS_piccoloDeviceModel &  parameter_1,
                                GALGAS_uint &  parameter_2,
                                GALGAS_ramBankTable &  parameter_3,
                                GALGAS_registerTable &  parameter_4,
                                GALGAS_bootloaderReservedRAMmap &  parameter_5,
                                GALGAS_routineDeclarationList &  parameter_6,
                                GALGAS_routineDeclarationList &  parameter_7,
                                GALGAS_luint &  parameter_8
                                COMMA_UNUSED_LOCATION_ARGS) {
  C_Lexique_piccolo_5F_lexique * scanner = NULL ;
  macroMyNew (scanner, C_Lexique_piccolo_5F_lexique (inCompiler, inSourceString.stringValue (), "" COMMA_HERE)) ;
  if (scanner->sourceText () != NULL) {
    const bool ok = scanner->performBottomUpParsing (gActionTable, gNonTerminalNames,
                                                     gActionTableIndex, gSuccessorTable,
                                                     gProductionsTable) ;
    if (ok && ! executionModeIsSyntaxAnalysisOnly ()) {
      cGrammar_pic_31__38__5F_grammar _grammar ;
      _grammar.nt_start_5F_symbol_importBootloaderSpecification (parameter_1, parameter_2, parameter_3, parameter_4, parameter_5, parameter_6, parameter_7, parameter_8, scanner) ;
    }
  }
  macroDetachSharedObject (scanner) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//         'midrange_instruction_list' non terminal implementation           *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_grammar::nt_midrange_5F_instruction_5F_list_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 29 :
      rule_midrange_5F_syntax_midrange_5F_instruction_5F_list_i1_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_grammar::nt_midrange_5F_instruction_5F_list_ (GALGAS_midrange_5F_instructionList &  parameter_1,
                                GALGAS_bool &  parameter_2,
                                GALGAS_bool &  parameter_3,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 29 :
      rule_midrange_5F_syntax_midrange_5F_instruction_5F_list_i1_(parameter_1, parameter_2, parameter_3, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'midrange_interrupt_definition' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_grammar::nt_midrange_5F_interrupt_5F_definition_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 30 :
      rule_midrange_5F_syntax_midrange_5F_interrupt_5F_definition_i2_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_grammar::nt_midrange_5F_interrupt_5F_definition_ (GALGAS_midrange_5F_interruptDefinitionList &  parameter_1,
                                GALGAS_bool &  parameter_2,
                                GALGAS_bool &  parameter_3,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 30 :
      rule_midrange_5F_syntax_midrange_5F_interrupt_5F_definition_i2_(parameter_1, parameter_2, parameter_3, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'midrange_routine_definition' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

