pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
void cGrammar_pic_31__38__5F_grammar::nt_midrange_5F_routine_5F_definition_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 31 :
      rule_midrange_5F_syntax_midrange_5F_routine_5F_definition_i3_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_grammar::nt_midrange_5F_routine_5F_definition_ (GALGAS_midrange_5F_routineDefinitionList &  parameter_1,
                                GALGAS_bool &  parameter_2,
                                GALGAS_bool &  parameter_3,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 31 :
      rule_midrange_5F_syntax_midrange_5F_routine_5F_definition_i3_(parameter_1, parameter_2, parameter_3, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'midrange_structured_instruction' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_grammar::nt_midrange_5F_structured_5F_instruction_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 32 :
      rule_midrange_5F_syntax_midrange_5F_structured_5F_instruction_i4_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_grammar::nt_midrange_5F_structured_5F_instruction_ (GALGAS_midrange_5F_instruction &  parameter_1,
                                GALGAS_bool &  parameter_2,
                                GALGAS_bool &  parameter_3,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 32 :
      rule_midrange_5F_syntax_midrange_5F_structured_5F_instruction_i4_(parameter_1, parameter_2, parameter_3, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//     'midrange_structured_if_instruction' non terminal implementation      *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_grammar::nt_midrange_5F_structured_5F_if_5F_instruction_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 33 :
      rule_midrange_5F_syntax_midrange_5F_structured_5F_if_5F_instruction_i5_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_grammar::nt_midrange_5F_structured_5F_if_5F_instruction_ (GALGAS_midrange_5F_instruction &  parameter_1,
                                GALGAS_bool &  parameter_2,
                                GALGAS_bool &  parameter_3,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 33 :
      rule_midrange_5F_syntax_midrange_5F_structured_5F_if_5F_instruction_i5_(parameter_1, parameter_2, parameter_3, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'midrange_simple_instruction' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_grammar::nt_midrange_5F_simple_5F_instruction_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 34 :
      rule_midrange_5F_syntax_midrange_5F_simple_5F_instruction_i6_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_grammar::nt_midrange_5F_simple_5F_instruction_ (GALGAS_midrange_5F_instruction &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 34 :
      rule_midrange_5F_syntax_midrange_5F_simple_5F_instruction_i6_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//         'midrange_condition_factor' non terminal implementation           *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_grammar::nt_midrange_5F_condition_5F_factor_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 35 :
      rule_midrange_5F_syntax_midrange_5F_condition_5F_factor_i7_parse(inLexique) ;
    break ;
  case 36 :
      rule_midrange_5F_syntax_midrange_5F_condition_5F_factor_i8_parse(inLexique) ;
    break ;
  case 37 :
      rule_midrange_5F_syntax_midrange_5F_condition_5F_factor_i9_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_grammar::nt_midrange_5F_condition_5F_factor_ (GALGAS_midrange_5F_conditionExpression &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 35 :
      rule_midrange_5F_syntax_midrange_5F_condition_5F_factor_i7_(parameter_1, inLexique) ;
    break ;
  case 36 :
      rule_midrange_5F_syntax_midrange_5F_condition_5F_factor_i8_(parameter_1, inLexique) ;
    break ;
  case 37 :
      rule_midrange_5F_syntax_midrange_5F_condition_5F_factor_i9_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'midrange_condition_expression' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

