pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
void cGrammar_pic_31__38__5F_grammar::nt_baseline_5F_structured_5F_if_5F_instruction_ (GALGAS_baseline_5F_instruction &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 44 :
      rule_baseline_5F_syntax_baseline_5F_structured_5F_if_5F_instruction_i4_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'baseline_simple_instruction' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_grammar::nt_baseline_5F_simple_5F_instruction_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 45 :
      rule_baseline_5F_syntax_baseline_5F_simple_5F_instruction_i5_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_grammar::nt_baseline_5F_simple_5F_instruction_ (GALGAS_baseline_5F_instruction &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 45 :
      rule_baseline_5F_syntax_baseline_5F_simple_5F_instruction_i5_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//         'baseline_condition_factor' non terminal implementation           *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_grammar::nt_baseline_5F_condition_5F_factor_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 46 :
      rule_baseline_5F_syntax_baseline_5F_condition_5F_factor_i6_parse(inLexique) ;
    break ;
  case 47 :
      rule_baseline_5F_syntax_baseline_5F_condition_5F_factor_i7_parse(inLexique) ;
    break ;
  case 48 :
      rule_baseline_5F_syntax_baseline_5F_condition_5F_factor_i8_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_grammar::nt_baseline_5F_condition_5F_factor_ (GALGAS_baseline_5F_conditionExpression &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 46 :
      rule_baseline_5F_syntax_baseline_5F_condition_5F_factor_i6_(parameter_1, inLexique) ;
    break ;
  case 47 :
      rule_baseline_5F_syntax_baseline_5F_condition_5F_factor_i7_(parameter_1, inLexique) ;
    break ;
  case 48 :
      rule_baseline_5F_syntax_baseline_5F_condition_5F_factor_i8_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'baseline_condition_expression' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_grammar::nt_baseline_5F_condition_5F_expression_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 49 :
      rule_baseline_5F_syntax_baseline_5F_condition_5F_expression_i9_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_grammar::nt_baseline_5F_condition_5F_expression_ (GALGAS_baseline_5F_conditionExpression &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 49 :
      rule_baseline_5F_syntax_baseline_5F_condition_5F_expression_i9_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//          'baseline_condition_term' non terminal implementation            *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_grammar::nt_baseline_5F_condition_5F_term_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 50 :
      rule_baseline_5F_syntax_baseline_5F_condition_5F_term_i10_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_grammar::nt_baseline_5F_condition_5F_term_ (GALGAS_baseline_5F_conditionExpression &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 50 :
      rule_baseline_5F_syntax_baseline_5F_condition_5F_term_i10_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//            'routine_declaration' non terminal implementation              *
//                                                                           *
//---------------------------------------------------------------------------*

