pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
void cGrammar_pic_31__38__5F_grammar::nt_routine_5F_declaration_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 53 :
      rule_pic_31__38__5F_bootloader_5F_syntax_routine_5F_declaration_i2_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_grammar::nt_routine_5F_declaration_ (GALGAS_routineDeclarationList &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 53 :
      rule_pic_31__38__5F_bootloader_5F_syntax_routine_5F_declaration_i2_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'parse_bootloader' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_grammar::nt_parse_5F_bootloader_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 51 :
      rule_pic_31__38__5F_bootloader_5F_syntax_parse_5F_bootloader_i0_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_grammar::nt_parse_5F_bootloader_ (GALGAS_lstring &  parameter_1,
                                GALGAS_lstring &  parameter_2,
                                GALGAS_routineDeclarationList &  parameter_3,
                                GALGAS_bootloaderReservedRAMmap &  parameter_4,
                                GALGAS_luint &  parameter_5,
                                GALGAS_routineDeclarationList &  parameter_6,
                                GALGAS_ramDefinitionList &  parameter_7,
                                GALGAS_string &  parameter_8,
                                GALGAS_piccoloDeviceModel &  parameter_9,
                                GALGAS_uint &  parameter_10,
                                GALGAS_ramBankTable &  parameter_11,
                                GALGAS_registerTable &  parameter_12,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 51 :
      rule_pic_31__38__5F_bootloader_5F_syntax_parse_5F_bootloader_i0_(parameter_1, parameter_2, parameter_3, parameter_4, parameter_5, parameter_6, parameter_7, parameter_8, parameter_9, parameter_10, parameter_11, parameter_12, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_0' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_0 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 54 55 56 57 58 59 60 61 62
  return inLexique->nextProductionIndex () - 53 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_1' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_1 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 63 64
  return inLexique->nextProductionIndex () - 62 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_2' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_2 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 65 66
  return inLexique->nextProductionIndex () - 64 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_3' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_3 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 67 68
  return inLexique->nextProductionIndex () - 66 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_4' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_4 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 69 70
  return inLexique->nextProductionIndex () - 68 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_5' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_5 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 71 72
  return inLexique->nextProductionIndex () - 70 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_6' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_6 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 73 74
  return inLexique->nextProductionIndex () - 72 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_7' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_7 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 75 76
  return inLexique->nextProductionIndex () - 74 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_8' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_8 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 77 78
  return inLexique->nextProductionIndex () - 76 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_9' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

