pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_47 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 233 234 235 236
  return inLexique->nextProductionIndex () - 232 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_48' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_48 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 237 238 239
  return inLexique->nextProductionIndex () - 236 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_49' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_49 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 240 241
  return inLexique->nextProductionIndex () - 239 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_50' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_50 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 242 243 244 245 246 247 248
  return inLexique->nextProductionIndex () - 241 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_51' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_51 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 249 250 251 252 253
  return inLexique->nextProductionIndex () - 248 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_52' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_52 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 254 255 256 257
  return inLexique->nextProductionIndex () - 253 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_53' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_53 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 258 259 260 261 262 263 264
  return inLexique->nextProductionIndex () - 257 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_54' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_54 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 265 266
  return inLexique->nextProductionIndex () - 264 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_55' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_syntax_55 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 267 268
  return inLexique->nextProductionIndex () - 266 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//  'select_pic_31__38__5F_start_5F_symbol_0' non terminal implementation    *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_start_5F_symbol_0 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 269 270 271
  return inLexique->nextProductionIndex () - 268 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_0' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_0 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 272 273 274 275 276 277 278
  return inLexique->nextProductionIndex () - 271 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_1' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_1 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 279 280 281
  return inLexique->nextProductionIndex () - 278 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_2' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

