pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_2 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 282 283
  return inLexique->nextProductionIndex () - 281 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_3' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_3 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 284 285
  return inLexique->nextProductionIndex () - 283 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_4' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_4 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 286 287
  return inLexique->nextProductionIndex () - 285 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_5' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_5 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 288 289 290
  return inLexique->nextProductionIndex () - 287 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_6' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_6 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 291 292
  return inLexique->nextProductionIndex () - 290 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_7' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_7 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 293 294 295 296 297 298 299 300 301 302 303
  return inLexique->nextProductionIndex () - 292 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_8' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_8 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 304 305
  return inLexique->nextProductionIndex () - 303 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_9' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_9 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 306 307
  return inLexique->nextProductionIndex () - 305 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_10' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_10 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 308 309
  return inLexique->nextProductionIndex () - 307 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_11' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_11 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 310 311
  return inLexique->nextProductionIndex () - 309 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_12' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_12 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 312 313 314
  return inLexique->nextProductionIndex () - 311 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_13' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

