pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_13 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 315 316 317 318 319 320 321 322 323 324
  return inLexique->nextProductionIndex () - 314 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_14' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_14 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 325 326 327 328 329 330 331 332 333 334 335 336
  return inLexique->nextProductionIndex () - 324 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_15' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_15 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 337 338
  return inLexique->nextProductionIndex () - 336 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_16' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_16 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 339 340
  return inLexique->nextProductionIndex () - 338 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_17' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_17 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 341 342 343 344 345 346
  return inLexique->nextProductionIndex () - 340 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_18' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_18 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 347 348
  return inLexique->nextProductionIndex () - 346 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_19' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_19 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 349 350
  return inLexique->nextProductionIndex () - 348 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_20' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_20 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 351 352
  return inLexique->nextProductionIndex () - 350 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_21' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_21 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 353 354
  return inLexique->nextProductionIndex () - 352 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_22' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_22 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 355 356
  return inLexique->nextProductionIndex () - 354 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_midrange_5F_syntax_23' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_midrange_5F_syntax_23 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 357 358
  return inLexique->nextProductionIndex () - 356 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_0' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

