pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_0 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 359 360 361 362 363 364
  return inLexique->nextProductionIndex () - 358 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_1' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_1 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 365 366 367
  return inLexique->nextProductionIndex () - 364 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_2' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_2 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 368 369
  return inLexique->nextProductionIndex () - 367 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_3' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_3 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 370 371
  return inLexique->nextProductionIndex () - 369 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_4' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_4 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 372 373 374 375 376 377
  return inLexique->nextProductionIndex () - 371 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_5' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_5 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 378 379
  return inLexique->nextProductionIndex () - 377 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_6' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_6 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 380 381
  return inLexique->nextProductionIndex () - 379 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_7' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_7 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 382 383
  return inLexique->nextProductionIndex () - 381 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_8' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_8 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 384 385
  return inLexique->nextProductionIndex () - 383 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_9' non terminal implementation          *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_9 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 386 387 388
  return inLexique->nextProductionIndex () - 385 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_10' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

