pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_10 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 389 390 391 392 393 394 395 396 397 398 399 400
  return inLexique->nextProductionIndex () - 388 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_11' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_11 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 401 402 403 404 405 406 407 408 409 410 411 412
  return inLexique->nextProductionIndex () - 400 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_12' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_12 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 413 414
  return inLexique->nextProductionIndex () - 412 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_13' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_13 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 415 416
  return inLexique->nextProductionIndex () - 414 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_14' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_14 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 417 418 419 420
  return inLexique->nextProductionIndex () - 416 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_15' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_15 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 421 422
  return inLexique->nextProductionIndex () - 420 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_16' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_16 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 423 424
  return inLexique->nextProductionIndex () - 422 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_17' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_17 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 425 426
  return inLexique->nextProductionIndex () - 424 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_18' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_18 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 427 428
  return inLexique->nextProductionIndex () - 426 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_19' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_19 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 429 430
  return inLexique->nextProductionIndex () - 428 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//        'select_baseline_5F_syntax_20' non terminal implementation         *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_baseline_5F_syntax_20 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 431 432
  return inLexique->nextProductionIndex () - 430 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//'select_pic_31__38__5F_bootloader_5F_syntax_0' non terminal implementation *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_bootloader_5F_syntax_0 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 433 434 435 436
  return inLexique->nextProductionIndex () - 432 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//'select_pic_31__38__5F_bootloader_5F_syntax_1' non terminal implementation *
//                                                                           *
//---------------------------------------------------------------------------*

