pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.cpp
PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_bootloader_5F_syntax_1 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 437 438
  return inLexique->nextProductionIndex () - 436 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//'select_pic_31__38__5F_bootloader_5F_syntax_2' non terminal implementation *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_bootloader_5F_syntax_2 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 439 440
  return inLexique->nextProductionIndex () - 438 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//'select_pic_31__38__5F_bootloader_5F_syntax_3' non terminal implementation *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_bootloader_5F_syntax_3 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 441 442
  return inLexique->nextProductionIndex () - 440 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//'select_pic_31__38__5F_bootloader_5F_syntax_4' non terminal implementation *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_bootloader_5F_syntax_4 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 443 444
  return inLexique->nextProductionIndex () - 442 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//'select_pic_31__38__5F_bootloader_5F_syntax_5' non terminal implementation *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_bootloader_5F_syntax_5 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 445 446 447
  return inLexique->nextProductionIndex () - 444 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//'select_pic_31__38__5F_bootloader_5F_syntax_6' non terminal implementation *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_grammar::select_pic_31__38__5F_bootloader_5F_syntax_6 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 448 449
  return inLexique->nextProductionIndex () - 447 ;
}

//---------------------------------------------------------------------------*

